/**
 * Created by ly on 2020/7/7
 * 专利查询
 */
const graphdb = require('../../neo4j.js')
const axios = require('axios');
const { formatDateTime } = require('../../util/util')
const querystring = require('querystring');
const url = require('url');
const { session } = require('neo4j-driver');

async function zsglExpert2kg() {
    const that = this
    this.set('Access-Control-Allow-Origin', '*')
    this.set("Access-Control-Allow-Headers", "Origin, X-Requested-With, Content-Type, Accept")
    // const req = querystring.parse(url.parse(this.url).query)

    // const req = test
    // req.pro_info = JSON.parse(req.pro_info)

    //const req = JSON.stringify(this.request.body)
    const date = new Date()
    // var req = this.request.body
    // console.log("######", req.data)
    // req = JSON.parse(req.data)
    req = [
        { "姓名": "丁华", "工作单位": "吉利汽车研究院（宁波）有限公司", "行政职务": "资深总工程师", "移动电话": "18658127799", "地区": "宁波市", "电子邮箱": "dingh@geely.com", "专业领域": "汽车研发产品/工艺/管理验证技术研究，研发生产一体化整车智能制造方法的研究与产业化开发", "专家组": "专用装备,工业物联网", "技术领域": "汽车制造", "专家类型": "行业类专家" },
        { "姓名": "丁明杰", "工作单位": "宁波萨瑞通讯有限公司", "行政职务": "重庆办事处经理（在宁波办公）", "技术职称/学历": "高级工程师", "移动电话": "13586693821", "地区": "宁波市", "电子邮箱": "dingmingjie@sagereal.com", "专业领域": "终端驱动软件开发设计经验", "专家组": "工业物联网", "技术领域": "软件信息服务,新一代信息技术", "专家类型": "技术类专家" },
        { "姓名": "丁镇臣", "工作单位": "万华化学（宁波）容威聚氨酯有限公司", "行政职务": "高级工程师", "技术职称/学历": "高级工程师", "移动电话": "13989365252", "地区": "宁波市", "电子邮箱": "30101387@qq.com", "专业领域": "化工工艺", "专家组": "专用装备", "技术领域": "新材料", "专家类型": "技术类专家" },
        { "姓名": "严华锋", "工作单位": "浙江大丰实业股份有限公司", "行政职务": "总工程师", "移动电话": "13516818238", "地区": "宁波市", "电子邮箱": "yhf011@hotmail.com", "专家组": "专用装备", "技术领域": "高端装备", "专家类型": "行业类专家" },
        { "姓名": "严培义", "工作单位": "宁波汇众粉末机械制造有限公司", "行政职务": "董事长", "技术职称/学历": "董事长", "移动电话": "13906696015", "地区": "宁波市", "电子邮箱": "py@nbhz.com.cn", "专业领域": "高端装备中的智能制造装备", "专家组": "智能制造", "技术领域": "高端装备", "专家类型": "行业类专家" },
        { "姓名": "丰其云", "工作单位": "浙江大丰实业股份有限公司", "行政职务": "副总经理", "移动电话": "13958082908", "地区": "宁波市", "电子邮箱": "13958082908@139.com", "专业领域": "机电一体化", "专家组": "专用装备", "专家类型": "行业类专家" },
        { "姓名": "乔永民", "工作单位": "宁波杉杉新材料有限公司", "行政职务": "研发总监", "技术职称/学历": "高级工程师", "移动电话": "13917205391", "地区": "宁波市", "电子邮箱": "qiao.yongmin@shanshantech.com", "专业领域": "新材料", "专家组": "石墨烯", "技术领域": "新材料", "专家类型": "技术类专家" },
        { "姓名": "付俊", "工作单位": "中国科学院宁波材料技术与工程研究所", "行政职务": "副所长", "技术职称/学历": "研究员", "移动电话": "15968424387", "地区": "宁波市", "电子邮箱": "fujun@nimte.ac.cn", "专业领域": "高分子材料结构与功能调控", "技术领域": "生物医药,新材料", "专家类型": "技术类专家" },
        { "姓名": "任传杰", "工作单位": "宁波夏厦齿轮有限责任公司", "行政职务": "技术副总", "技术职称/学历": "高级工程师", "移动电话": "13505743257", "地区": "宁波市", "电子邮箱": "c.j.ren@chinaxiasha.com", "专业领域": "机械加工工艺、精密行星减速机设计制造，机械制造行业", "专家组": "关键基础件", "技术领域": "汽车制造", "专家类型": "技术类专家" },
        { "姓名": "任忠平", "工作单位": "宁波卓胜新材料有限公司", "技术职称/学历": "高级工程师", "移动电话": "13780011666", "地区": "宁波市", "电子邮箱": "rzp8088@126.com", "专业领域": "机械电子以及材料", "专家组": "关键基础件", "技术领域": "新一代信息技术", "专家类型": "技术类专家" },
        { "姓名": "任梁", "工作单位": "宁波芯空间集成电路有限公司", "行政职务": "总经理", "技术职称/学历": "高级工程师", "移动电话": "13396611688", "地区": "宁波市", "电子邮箱": "renl@icspaces.cn", "专家组": "集成电路,工业物联网", "技术领域": "海洋高技术,软件信息服务,新一代信息技术,科技服务", "专家类型": "技术类专家" },
        { "姓名": "任莉", "工作单位": "宁波康大美术用品集团有限公司", "行政职务": "研发经理", "技术职称/学历": "高级工程师", "移动电话": "18957860848", "地区": "宁波市", "电子邮箱": "renli@china-conda.com", "技术领域": "新材料", "专家类型": "技术类专家" },
        { "姓名": "何云海", "工作单位": "浙江启鑫新能源科技股份有限公司", "行政职务": "副总经理", "技术职称/学历": "高级经济师", "移动电话": "13516780828", "地区": "宁波市", "电子邮箱": "Nbhyh888@163.com", "技术领域": "清洁能源,科技服务", "专家类型": "财务类专家" },
        { "姓名": "何仲昆", "工作单位": "宁波工程学院", "行政职务": "网络系主任", "技术职称/学历": "高级工程师", "移动电话": "13805874010", "地区": "宁波市", "电子邮箱": "nbhzk@163.com", "专业领域": "计算机、智能制造", "专家组": "集成电路,工业物联网", "技术领域": "新一代信息技术", "专家类型": "技术类专家" },
        { "姓名": "何宏祥", "工作单位": "宁波金创享智能科技有限公司", "行政职务": "董事长", "移动电话": "15867366699", "地区": "宁波市", "电子邮箱": "hhx7737@163.com", "专业领域": "金属材料及热处理", "专家组": "专用装备", "技术领域": "高端装备,检验检测", "专家类型": "行业类专家" },
        { "姓名": "何流", "工作单位": "中国科学院宁波材料技术与工程研究所", "行政职务": "事业部主任", "技术职称/学历": "正高级工程师", "移动电话": "18258725218", "地区": "宁波市", "电子邮箱": "heliu@nimte.ac.cn", "专业领域": "高分子及复合材料", "技术领域": "新材料", "专家类型": "技术类专家" },
        { "姓名": "余忠华", "工作单位": "浙江大学", "行政职务": "博士生导师", "技术职称/学历": "教授", "移动电话": "13355713979", "地区": "杭州市", "专业领域": "先进制造技术与装备智能检测与质量控制", "专家类型": "技术类专家" },
        { "姓名": "俞岳平", "工作单位": "宁波亿文特自动化科技有限公司", "行政职务": "总经理", "技术职称/学历": "副教授", "移动电话": "13806671308", "地区": "宁波市", "电子邮箱": "yyp1977@126.com", "专业领域": "从事制造工艺和装备研发、机电产品研发与管理", "专家组": "专用装备", "技术领域": "新兴产业", "专家类型": "行业类专家" },
        { "姓名": "俞建定", "工作单位": "宁波大学", "技术职称/学历": "高级工程师", "移动电话": "13003770082", "地区": "宁波市", "电子邮箱": "yujianding@nbu.edu.cn", "专业领域": "工业机械手控制设计,智能仪器仪表,传感器", "专家组": "智能制造,集成电路,关键基础件", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "倪培君", "工作单位": "中国兵器科学研究院宁波分院", "行政职务": "总工程师", "技术职称/学历": "研究员", "移动电话": "13777273818", "地区": "宁波市", "电子邮箱": "nipeijun@vip.sina.com", "专业领域": "固体物理 材料工程", "专家组": "高端金属合金材料", "技术领域": "检验检测,新材料", "专家类型": "技术类专家" },
        { "姓名": "傅冠生", "工作单位": "宁波中车新能源科技有限公司", "行政职务": "总经理", "技术职称/学历": "教授级高工", "移动电话": "18858217077", "地区": "宁波市", "电子邮箱": "gsfu@crrccap.com", "专业领域": "材料成型及控制工程，超级电容储能系统结构设计和集成", "专家组": "石墨烯,关键基础件", "技术领域": "节能环保,汽车制造,高端装备,新一代信息技术,新材料", "专家类型": "技术类专家" },
        { "姓名": "傅建中", "工作单位": "宁波智能制造技术研究院有限公司", "行政职务": "执行院长", "技术职称/学历": "正教授", "移动电话": "13819193086", "地区": "宁波市", "电子邮箱": "fjz@zju.edu.cn", "专业领域": "智能制造/机械工程及其自动化", "专家组": "关键基础件,工业物联网,专用装备,智能制造", "技术领域": "高端装备,软件信息服务,新一代信息技术,科技服务,工业创新设计", "专家类型": "技术类专家" },
        { "姓名": "傅科杰", "工作单位": "宁波检验检疫科学技术研究院", "行政职务": "副主任", "技术职称/学历": "高级工程师", "移动电话": "13967887010", "地区": "宁波市", "电子邮箱": "fkjciq@126.com", "专业领域": "纺织化学与染整工程", "技术领域": "时尚纺织服装,检验检测", "专家类型": "技术类专家" },
        { "姓名": "关宏伟", "工作单位": "宁波大红鹰学院，机电学院，控制工程研究所", "行政职务": "所长", "技术职称/学历": "讲师", "移动电话": "13736195740", "地区": "宁波市", "电子邮箱": "Ghw_nit@126.com", "专业领域": "复杂系统建模、计算机控制系统设计", "专家组": "专用装备", "技术领域": "高端装备", "专家类型": "行业类专家" },
        { "姓名": "冯志敏", "工作单位": "宁波大学", "行政职务": "副校长", "技术职称/学历": "教授", "移动电话": "13615882588", "地区": "宁波市", "专业领域": "机械", "专家类型": "技术类专家" },
        { "姓名": "冯毅雄", "工作单位": "宁波智能制造技术研究院有限公司", "行政职务": "高级研究员", "技术职称/学历": "教授", "移动电话": "13819161642", "地区": "宁波市", "电子邮箱": "fyxtv@zju.edu.cn", "专业领域": "高端装备、智能制造技术", "专家组": "专用装备,工业物联网,关键基础件", "技术领域": "高端装备,软件信息服务,新一代信息技术,科技服务,工业创新设计", "专家类型": "技术类专家" },
        { "姓名": "冯礼伟", "工作单位": "宁波和信制药设备有限公司", "行政职务": "副总经理", "移动电话": "18857463888", "地区": "宁波市", "电子邮箱": "flw@nbhxyj.com", "专业领域": "医用水处理设备制造、氩弧焊工艺", "专家组": "专用装备", "技术领域": "节能环保", "专家类型": "行业类专家" },
        { "姓名": "刘严强", "工作单位": "浙江钰烯腐蚀控制股份有限公司", "行政职务": "技术总监", "移动电话": "13811414757", "地区": "宁波市", "电子邮箱": "Liu.yanqiang@yuxicorrosion.com", "专业领域": "化工材料", "技术领域": "工业创新设计", "专家类型": "行业类专家" },
        { "姓名": "刘优娜", "工作单位": "宁波市纤维检验所", "行政职务": "副所长", "技术职称/学历": "高级工程师", "移动电话": "13780080619", "地区": "宁波市", "电子邮箱": "378639784@qq.com", "专业领域": "纺织工程", "技术领域": "时尚纺织服装,检验检测", "专家类型": "技术类专家" },
        { "姓名": "刘兆平", "工作单位": "中国科学院宁波材料技术与工程研究所", "技术职称/学历": "高级研究员", "移动电话": "13857479925", "地区": "宁波市", "电子邮箱": "liuzp@nimte.ac.cn", "专业领域": "材料物理与化学", "专家组": "石墨烯", "技术领域": "新材料", "专家类型": "技术类专家" },
        { "姓名": "刘宝生", "工作单位": "博格华纳汽车零部件（宁波）有限公司", "行政职务": "供应商开发与质量经理", "技术职称/学历": "高级工程师", "移动电话": "13857843380", "地区": "宁波市", "专业领域": "质量工程", "专家类型": "技术类专家" },
        { "姓名": "刘文", "工作单位": "浙江大学宁波理工学院", "技术职称/学历": "副教授", "移动电话": "18057486600", "地区": "宁波市", "电子邮箱": "davynjtu@126.com", "专业领域": "车辆工程", "专家组": "高端金属合金材料,工业物联网,关键基础件,专用装备", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "刘永跃", "工作单位": "宁波合力模具科技股份有限公司", "行政职务": "技术中心副总监", "技术职称/学历": "高级工程师", "移动电话": "13777030012", "地区": "宁波市", "专业领域": "材料成型，工艺、装备、新材料", "专家组": "高端金属合金材料", "技术领域": "高端装备,新材料", "专家类型": "技术类专家" },
        { "姓名": "刘江", "工作单位": "中科院宁波材料技术与工程研究所", "技术职称/学历": "高级研究员", "移动电话": "18758319186", "地区": "宁波市", "电子邮箱": "jimmyliu@nimte.ac.cn", "专业领域": "计算机应用", "技术领域": "生物医药,新材料", "专家类型": "技术类专家" },
        { "姓名": "刘湘涟", "工作单位": "宁波金科磁业有限公司", "行政职务": "总技术工程师", "移动电话": "13857853382", "地区": "宁波市", "电子邮箱": "southeastchina318@yahoo.com.cn", "专家类型": "行业类专家" },
        { "姓名": "刘炳宪", "工作单位": "宁波江丰生物信息技术有限公司", "行政职务": "董事长", "移动电话": "13646671122", "地区": "宁波市", "电子邮箱": "bingxian.liu@kfbio.cn", "专业领域": "无线电技术与信息系统", "专家组": "专用装备", "技术领域": "软件信息服务,新一代信息技术", "专家类型": "行业类专家" },
        { "姓名": "刘红伟", "工作单位": "中国兵器科学研究院宁波院", "行政职务": "副所长", "技术职称/学历": "研究员", "移动电话": "13586517687", "地区": "宁波市", "电子邮箱": "13586517687@139.com", "专业领域": "先进焊接工艺、高端焊接材料、异种金属材料连接", "专家组": "高端金属合金材料", "技术领域": "新材料", "专家类型": "技术类专家" },
        { "姓名": "刘西恒", "工作单位": "宁波海天精工机械有限公司", "技术职称/学历": "教授级高级工程师", "移动电话": "13586870158", "地区": "宁波市", "电子邮箱": "lxh@mail.haitian.com", "专业领域": "机械", "专家组": "智能制造", "专家类型": "技术类专家" },
        { "姓名": "刘诗丰", "工作单位": "宁波舜宇电子有限公司", "技术职称/学历": "总工程师", "移动电话": "0574-62882368", "地区": "宁波市", "电子邮箱": "khr@sunny-optics.com", "专业领域": "光学仪器", "专家组": "光学电子,专用装备", "专家类型": "技术类专家" },
        { "姓名": "刘钢", "工作单位": "宁海正诚专利技术咨询服务有限公司", "技术职称/学历": "教授（现已退休）", "移动电话": "13586758703", "地区": "宁波市", "电子邮箱": "zgxinfeng@163.com", "专业领域": "模具、智能自动化、机床、电子、家电、磁性材料", "专家组": "专用装备", "技术领域": "高端装备,工业创新设计", "专家类型": "技术类专家" },
        { "姓名": "励国旦", "工作单位": "宁波韵升股份有限公司", "技术职称/学历": "高级工程师", "移动电话": "13567848690", "地区": "宁波市", "电子邮箱": "ligd@ysweb.com", "专业领域": "工业自动化", "技术领域": "新一代信息技术", "专家类型": "技术类专家" },
        { "姓名": "包科华", "工作单位": "工作单位为宁波环洋新材料股份有限公司", "行政职务": "副总经理", "技术职称/学历": "高级工程师", "移动电话": "13805877329", "地区": "宁波市", "电子邮箱": "baokehua@163.com", "专业领域": "公司技术开发总负责，化学材料，绿色石化", "技术领域": "绿色石化", "专家类型": "技术类专家" },
        { "姓名": "华启升", "工作单位": "宁波富乐礼机器人科技有限公司", "行政职务": "总工程师", "技术职称/学历": "高级工程师", "移动电话": "13806665052", "地区": "宁波市", "专业领域": "光机电一体化", "专家组": "光学电子", "专家类型": "技术类专家" },
        { "姓名": "华旭", "工作单位": "宁波北仑大港科技创新服务中心", "行政职务": "主任", "技术职称/学历": "教授级高级工程师", "移动电话": "13586860233", "地区": "宁波市", "电子邮箱": "peak9@foxmail.com", "专业领域": "材料、热加工、模具、发动机", "专家组": "智能制造,高端金属合金材料", "技术领域": "新材料", "专家类型": "技术类专家" },
        { "姓名": "华雄飞", "工作单位": "宁波力导电子科技有限公司", "技术职称/学历": "高级工程师", "移动电话": "13906845621", "地区": "宁波市", "电子邮箱": "1244705367@qq.com", "专业领域": "电力、环保、工业控制领域计算机电子自动化专业", "专家组": "光学电子,集成电路", "技术领域": "新一代信息技术", "专家类型": "技术类专家" },
        { "姓名": "单东升", "工作单位": "宁波赛福汽车制动有限公司", "行政职务": "总经理", "移动电话": "18616560979", "地区": "宁波市", "电子邮箱": "sds@mail.tsinghua.edu.cn", "专业领域": "汽车工程", "技术领域": "汽车制造", "专家类型": "行业类专家" },
        { "姓名": "卢忠", "工作单位": "镇海区经信局", "行政职务": "党组成员、总经济师", "技术职称/学历": "高级工程师", "移动电话": "13506845803", "地区": "宁波市", "电子邮箱": "nbzhzj@163.com", "专家类型": "政府部门专家" },
        { "姓名": "古伍贤", "工作单位": "宁波柯林斯橡塑科技有限公司", "行政职务": "总经理", "技术职称/学历": "高级工程师", "移动电话": "13806670278", "地区": "宁波市", "电子邮箱": "lbrubber@163.com", "专家类型": "技术类专家" },
        { "姓名": "叶信红", "工作单位": "宁波东方电缆股份有限公司", "行政职务": "首席工程师", "技术职称/学历": "教授级高级工程师", "移动电话": "13705747803", "地区": "宁波市", "电子邮箱": "yxh@orientcable.co", "专业领域": "电线电缆、海底电缆、海洋脐带缆设计研发", "专家组": "集成电路", "技术领域": "海洋高技术", "专家类型": "技术类专家" },
        { "姓名": "叶信耀", "工作单位": "宁波华通电器集团股份有限公司", "行政职务": "副总、总工", "技术职称/学历": "高级工程师", "移动电话": "13805877182", "地区": "宁波市", "电子邮箱": "510661154@qq.com", "专业领域": "从事机械电器设计及管理研究通用设备高低压配电领域", "专家组": "专用装备", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "叶凌箭", "工作单位": "浙江大学宁波理工学院", "行政职务": "教学、科研副教授", "技术职称/学历": "副教授", "移动电话": "13429251093", "地区": "宁波市", "电子邮箱": "ljye@nit.net.cn", "专业领域": "控制科学与工程", "专家组": "工业物联网,光学电子", "技术领域": "节能环保,家用电器,新一代信息技术", "专家类型": "行业类专家" },
        { "姓名": "叶春华", "工作单位": "宁波市经济和信息化委员会", "行政职务": "副书记、副主任，市智慧办主任", "技术职称/学历": "博士", "移动电话": "13957841599", "地区": "宁波市", "专家组": "集成电路,智能制造", "专家类型": "政府部门专家" },
        { "姓名": "叶朝伟", "工作单位": "浙江文谷软件有限公司", "行政职务": "总经理", "技术职称/学历": "总经理", "移动电话": "13858374078", "地区": "宁波市", "电子邮箱": "ycw@wingoht.com", "专业领域": "智能制造，数字化工厂", "专家组": "集成电路,工业物联网", "技术领域": "软件信息服务,新一代信息技术,科技服务", "专家类型": "行业类专家" },
        { "姓名": "叶松权", "工作单位": "宁波市高新区经发局", "行政职务": "副局长", "移动电话": "13706848203", "地区": "宁波市", "专家类型": "政府部门专家" },
        { "姓名": "叶群", "工作单位": "宁波方太厨具有限公司", "技术职称/学历": "高级工程师", "移动电话": "13738451961", "地区": "宁波市", "电子邮箱": "937782072@qq.com", "专业领域": "家用电器方面制造及工艺", "专家组": "专用装备", "技术领域": "家用电器", "专家类型": "技术类专家" },
        { "姓名": "吕卫民", "工作单位": "宁波市纤维检验所", "行政职务": "法制科主任", "技术职称/学历": "高级工程师", "移动电话": "13805863530", "地区": "宁波市", "电子邮箱": "nfi13@sina.com", "专业领域": "机电管理", "技术领域": "时尚纺织服装,检验检测,科技服务", "专家类型": "技术类专家" },
        { "姓名": "吕广强", "工作单位": "宁波广强机器人科技有限公司", "行政职务": "总经理", "技术职称/学历": "博士", "移动电话": "13618247832", "地区": "宁波市", "电子邮箱": "21601191@qq.com", "专业领域": "自动化装备制造", "专家组": "智能制造,专用装备", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "吕清平", "工作单位": "宁波圣龙汽车动力系统股份有限公司", "行政职务": "总工程师", "技术职称/学历": "高级工程师", "移动电话": "13957808759", "地区": "宁波市", "专家组": "关键基础件", "技术领域": "汽车制造", "专家类型": "技术类专家" },
        { "姓名": "吴志敏", "工作单位": "宁波天益医疗器械股份有限公司", "技术职称/学历": "高级经济师", "移动电话": "13805886950", "地区": "宁波市", "电子邮箱": "13805886950@tianyinnb.com", "专业领域": "医疗器械制造", "专家组": "专用装备", "技术领域": "生物医药", "专家类型": "技术类专家" },
        { "姓名": "吴涛", "工作单位": "宁波澳芙特橡胶有限公司", "技术职称/学历": "高级工程师", "移动电话": "15990564184", "地区": "宁波市", "电子邮箱": "Ophte@163.com", "技术领域": "新材料", "专家类型": "技术类专家" },
        { "姓名": "吴爱国", "工作单位": "中国科学院宁波材料技术与工程研究所", "技术职称/学历": "研究员", "移动电话": "15258117097", "地区": "宁波市", "电子邮箱": "aiguo@nimte.ac.cn", "专业领域": "材料物理与化学", "技术领域": "生物医药,新材料", "专家类型": "技术类专家" },
        { "姓名": "吴鹏程", "工作单位": "宁波市北仑区发改局", "行政职务": "党委副书记、副局长、调研员", "移动电话": "13806632191", "地区": "宁波市", "电子邮箱": "wupc@netd.gov.cn", "专家类型": "政府部门专家" },
        { "姓名": "周则威", "工作单位": "宁波东方电缆股份有限公司", "行政职务": "总工工程师", "技术职称/学历": "高级工程师", "移动电话": "15957455948", "地区": "宁波市", "电子邮箱": "zzwhy2000@126.com", "专业领域": "电线电缆、海底电缆、海洋脐带缆设计研发", "专家组": "集成电路", "技术领域": "海洋高技术", "专家类型": "技术类专家" },
        { "姓名": "周大明", "工作单位": "宁波市汽车零部件检测中心", "技术职称/学历": "高级工程师", "移动电话": "13957849795", "地区": "宁波市", "电子邮箱": "13957849795@139.com", "专家类型": "技术类专家" },
        { "姓名": "周安邦", "工作单位": "原市纺织服装行业办、省（市）纺织工程学会", "技术职称/学历": "高级工程师", "移动电话": "13957808636", "地区": "宁波市", "电子邮箱": "zhou_ab@hotmail.com", "技术领域": "时尚纺织服装", "专家类型": "技术类专家" },
        { "姓名": "周明", "工作单位": "宁波杉杉石墨烯科技有限公司", "行政职务": "宁波杉杉石墨烯科技有限公司院长", "技术职称/学历": "博士", "移动电话": "18576626196", "地区": "宁波市", "电子邮箱": "zhouming@shanshan.com", "专业领域": "石墨烯制备及应用技术、电化学储能材料及器件", "专家组": "石墨烯", "技术领域": "清洁能源,新材料", "专家类型": "技术类专家" },
        { "姓名": "周林华", "工作单位": "宁波工程学院", "技术职称/学历": "讲师", "移动电话": "13805870583", "地区": "宁波市", "专业领域": "语义web", "专家类型": "技术类专家" },
        { "姓名": "周秀林", "工作单位": "宁波明欣化工机械有限责任公司", "技术职称/学历": "高级工程师", "移动电话": "13884423902", "地区": "宁波市", "电子邮箱": "402929@163.com", "专业领域": "化工工程设计以及设备管理", "专家组": "专用装备", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "周赞斌", "工作单位": "宁波欧瑞特聚合物有限公司", "行政职务": "董事长", "移动电话": "13706842198", "地区": "宁波市", "电子邮箱": "zhouzb@sanponb.com", "专业领域": "环境工程", "技术领域": "新材料", "专家类型": "行业类专家" },
        { "姓名": "唐通裕", "工作单位": "慈溪市长河镇人民政府（退休）", "技术职称/学历": "财务管理国家一级（高级技师）/会计师", "移动电话": "13906745490", "地区": "宁波市", "电子邮箱": "910949203@qq.com", "专业领域": "财务管理与会计专业研究、技改项目与科技项目可行性论证", "专家类型": "财务类专家" },
        { "姓名": "夏峰", "工作单位": "宁波东方电缆股份有限公司", "行政职务": "总经理", "技术职称/学历": "工程师", "移动电话": "13706845616", "地区": "宁波市", "电子邮箱": "gavincf@orientcable.com", "专业领域": "电线电缆、海底电缆、海洋脐带缆设计研发", "技术领域": "海洋高技术", "专家类型": "行业类专家" },
        { "姓名": "夏庆华", "工作单位": "中国科学院宁波工业技术研究院", "技术职称/学历": "教授级高级工程师,研究员", "移动电话": "18815270101", "地区": "宁波市", "专家组": "关键基础件", "专家类型": "技术类专家" },
        { "姓名": "夏银水", "工作单位": "宁波大学信息科学与工程学院", "行政职务": "副院长", "技术职称/学历": "研究员", "移动电话": "13566542826", "地区": "宁波市", "电子邮箱": "xiayinshui@nbu.edu.cn", "专家组": "集成电路", "专家类型": "技术类专家" },
        { "姓名": "姚杰", "工作单位": "宁波合力模具科技股份有限公司", "行政职务": "副总经理兼技术中心总监", "技术职称/学历": "高级工程师", "移动电话": "13586808407", "地区": "宁波市", "电子邮箱": "yj@helimould.com", "专业领域": "材料成型（铸造，热冲压方向），机械、材料", "专家组": "关键基础件", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "姚灵", "工作单位": "宁波水表股分有限公司", "技术职称/学历": "教授级高级工程师", "移动电话": "13806630959", "地区": "宁波市", "专业领域": "机电", "专家类型": "技术类专家" },
        { "姓名": "姚霞银", "工作单位": "中国科学院宁波材料技术与工程研究所", "技术职称/学历": "研究员", "移动电话": "15258232437", "地区": "宁波市", "电子邮箱": "yaoxy@nimte.ac.cn", "专业领域": "材料物理与化学", "专家组": "石墨烯", "技术领域": "清洁能源,新材料", "专家类型": "技术类专家" },
        { "姓名": "姜涛", "工作单位": "宁波富德能源有限公司", "行政职务": "副总经理", "技术职称/学历": "教授级高工", "移动电话": "15857428756", "地区": "宁波市", "电子邮箱": "jiangt@fundenergy.com.cn", "专业领域": "甲醇制烯烃和芳烃的工业应用研究", "专家组": "关键基础件", "技术领域": "绿色石化", "专家类型": "技术类专家" },
        { "姓名": "孙云权", "工作单位": "宁波智畅机器人系统有限公司", "行政职务": "CEO", "技术职称/学历": "国家千人计划特聘专家", "移动电话": "0574-62617103", "地区": "宁波市", "电子邮箱": "sun@inter-smart.com", "专业领域": "先进制造技术", "专家组": "智能制造", "专家类型": "行业类专家" },
        { "姓名": "孙光耀", "工作单位": "宁波市产品质量监督检验研究院", "行政职务": "电子电器室主任", "技术职称/学历": "高级工程师", "移动电话": "13777077635", "地区": "宁波市", "电子邮箱": "sungy@nbzjy.cn", "专业领域": "电气工程及其自动化", "技术领域": "家用电器,检验检测", "专家类型": "技术类专家" },
        { "姓名": "孙华", "工作单位": "慈溪永敬会计师事务所有限公司", "技术职称/学历": "注册会计师", "移动电话": "13706743200", "地区": "宁波市", "专业领域": "财务专家", "专家类型": "财务类专家" },
        { "姓名": "孙向东", "工作单位": "宁波职业技术学院", "行政职务": "教授", "技术职称/学历": "高级工程师教授", "移动电话": "13336667007", "地区": "宁波市", "电子邮箱": "sunxiangdong6688@163.com", "专业领域": "石油化工", "技术领域": "绿色石化", "专家类型": "技术类专家" },
        { "姓名": "孙哲", "工作单位": "宁波威能传动技术股份有限公司", "技术职称/学历": "高级工程师", "移动电话": "13606841849", "地区": "宁波市", "专业领域": "机械设计及自动化", "技术领域": "工业创新设计", "专家类型": "技术类专家" },
        { "姓名": "孙培育", "工作单位": "宁波杉杉石墨烯科技有限公司", "行政职务": "总经理", "技术职称/学历": "博士", "移动电话": "13818432486", "地区": "宁波市", "电子邮箱": "sunpeiyu@shanshan.comsunpeiyu@sjtu.edu.cn", "专业领域": "石墨烯及应用技术、新能源领域", "专家组": "石墨烯", "技术领域": "清洁能源,新材料", "专家类型": "技术类专家" },
        { "姓名": "孙平范", "工作单位": "宁波慈星股份有限公司", "行政职务": "董事长", "技术职称/学历": "高级经济师", "移动电话": "13906622996", "地区": "宁波市", "电子邮箱": "Frank.sun@ci-xing.com", "专业领域": "智能针织装备、人工智能、互联网+智能制造", "专家类型": "行业类专家" },
        { "姓名": "孙建强", "工作单位": "宁波市产品质量监督检验研究院", "行政职务": "副院长", "技术职称/学历": "高级工程师", "移动电话": "13906684210", "地区": "宁波市", "电子邮箱": "nb-sjq@163.com", "技术领域": "节能环保,检验检测,科技服务", "专家类型": "技术类专家" },
        { "姓名": "孙德智", "工作单位": "宁波均胜电子股份有限公司", "技术职称/学历": "高级工程师", "移动电话": "13819859799", "地区": "宁波市", "电子邮箱": "sdezhi@163.com", "专业领域": "机械设计及理论", "技术领域": "工业创新设计", "专家类型": "技术类专家" },
        { "姓名": "孙行", "工作单位": "宁波市产品质量监督检验研究院", "行政职务": "理化中心副主任", "技术职称/学历": "高级工程师", "移动电话": "13806661916", "地区": "宁波市", "电子邮箱": "11829686@qq.com", "专业领域": "化学", "技术领域": "节能环保,清洁能源,绿色石化,检验检测,科技服务,新材料", "专家类型": "技术类专家" },
        { "姓名": "安鹏", "工作单位": "宁波工程学院", "行政职务": "副院长", "技术职称/学历": "副教授", "移动电话": "15888100121", "地区": "宁波市", "电子邮箱": "anp04@126.com", "专业领域": "电子信息工程", "专家组": "工业物联网,集成电路", "技术领域": "节能环保,新一代信息技术", "专家类型": "技术类专家" },
        { "姓名": "宋云峰", "工作单位": "宁波舜宇智能科技有限公司", "行政职务": "副总经理", "技术职称/学历": "研究员", "移动电话": "13601006502", "地区": "宁波市", "电子邮箱": "yfsong@sunnyoptical.com", "专业领域": "光学仪器", "专家组": "光学电子", "技术领域": "高端装备,检验检测", "专家类型": "技术类专家" },
        { "姓名": "宋执环", "工作单位": "浙江大学控制科学与工程学院工业控制研究所", "行政职务": "副所长", "技术职称/学历": "教授", "移动电话": "13306812244", "地区": "杭州市", "电子邮箱": "songzhihuan@zju.edu.cn", "专业领域": "工业自动化", "专家组": "高端金属合金材料,工业物联网", "技术领域": "海洋高技术,高端装备,检验检测", "专家类型": "行业类专家" },
        { "姓名": "宋振纶", "工作单位": "中国科学院宁波材料技术与工程研究所", "技术职称/学历": "研究员", "移动电话": "13867853975", "地区": "宁波市", "电子邮箱": "songzhenlun@nimte.ac.cn", "专业领域": "材料物理化学", "技术领域": "新材料", "专家类型": "技术类专家" },
        { "姓名": "宋贤发", "工作单位": "宁波市鄞州区东吴镇北村", "技术职称/学历": "教授级高级工程师", "移动电话": "15058858080", "地区": "宁波市", "电子邮箱": "gyb_2@riyuehi.com", "专业领域": "铸造", "专家组": "高端金属合金材料,关键基础件", "专家类型": "技术类专家" },
        { "姓名": "官万兵", "工作单位": "中国科学院宁波材料技术与工程研究所", "技术职称/学历": "研究员", "移动电话": "159574871042", "地区": "宁波市", "电子邮箱": "wbguan@nimte.ac.cn", "专业领域": "新能源材料与器件", "专家组": "高端金属合金材料", "技术领域": "清洁能源,新材料", "专家类型": "技术类专家" },
        { "姓名": "寇益", "工作单位": "浙江杰夫兄弟智慧科技有限公司", "行政职务": "高级顾问", "技术职称/学历": "博士", "移动电话": "18610198561", "地区": "宁波市", "电子邮箱": "kouy@jfbrother.com", "专业领域": "离散制造业信息化技术", "专家组": "专用装备,关键基础件", "技术领域": "高端装备,软件信息服务,新一代信息技术", "专家类型": "技术类专家" },
        { "姓名": "尤建国", "工作单位": "宁波市华宝塑胶模具股份有限公司", "行政职务": "副总经理", "技术职称/学历": "高级技师、工程师", "移动电话": "13506883180", "地区": "宁波市", "电子邮箱": "youjg@huabao-com.com", "专业领域": "模具设计制造", "专家组": "专用装备", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "尹济崇", "工作单位": "宁波威孚天力增压技术股份有限公司", "技术职称/学历": "研究员级高级工程师", "移动电话": "13957869088", "地区": "宁波市", "电子邮箱": "yjc@nbwftt.com", "专家组": "关键基础件", "技术领域": "汽车制造,科技服务,新材料", "专家类型": "技术类专家" },
        { "姓名": "尹辉", "工作单位": "宁波升谱光电股份有限公司", "行政职务": "副总经理兼封装事业部执行总经理，监事会主席", "技术职称/学历": "副总经理", "移动电话": "13867869039", "地区": "宁波市", "电子邮箱": "yh@sunpu-opto.com", "专业领域": "光电半导体，LED技术及照明灯具", "专家组": "集成电路,光学电子", "技术领域": "汽车制造,新材料", "专家类型": "技术类专家" },
        { "姓名": "岑行其", "工作单位": "慈溪新大鹏计算机软件有限公司", "行政职务": "副总经理", "移动电话": "13858306538", "地区": "宁波市", "电子邮箱": "33193050@qq.com", "专业领域": "ERP\\OA\\MES\\PLM", "专家组": "工业物联网", "技术领域": "软件信息服务,新一代信息技术", "专家类型": "行业类专家" },
        { "姓名": "崔丽君", "工作单位": "宁波中科莱恩机器人有限公司", "移动电话": "13603004631", "地区": "宁波市", "专业领域": "汽车零部件冲压数字化车间", "专家组": "工业物联网", "技术领域": "汽车制造", "专家类型": "行业类专家" },
        { "姓名": "崔建忠", "工作单位": "宁波科创制造技术开发有限公司", "行政职务": "董事长", "技术职称/学历": "高级工程师", "移动电话": "13566052321", "地区": "宁波市", "专业领域": "工业自动化", "专家组": "工业物联网", "技术领域": "工业创新设计", "专家类型": "技术类专家" },
        { "姓名": "崔泽昊", "工作单位": "宁波科创制造技术开发有限公司", "行政职务": "总经理", "技术职称/学历": "总经理", "移动电话": "13325840866", "地区": "宁波市", "专业领域": "智能化生活方式", "专家组": "智能制造,集成电路", "技术领域": "新一代信息技术", "专家类型": "行业类专家" },
        { "姓名": "左国坤", "工作单位": "中国科学院宁波材料技术与工程研究所", "行政职务": "团队负责人", "技术职称/学历": "研究员", "移动电话": "15824205927", "地区": "宁波市", "专业领域": "智能康复机器人系统、嵌入式技术、人机交互中的触力觉感知接口技术", "专家组": "专用装备", "技术领域": "生物医药,高端装备", "专家类型": "技术类专家" },
        { "姓名": "廖振华", "工作单位": "宁波市产品质量监督检验研究院", "技术职称/学历": "高级工程师", "移动电话": "18758380167", "地区": "宁波市", "电子邮箱": "694421566＠qq.com", "专业领域": "材料工程", "专家组": "稀土磁性材料", "技术领域": "检验检测", "专家类型": "技术类专家" },
        { "姓名": "张书芬", "工作单位": "宁波市高新区清逸路66号C座505室（宁波市食品检验检测研究院）", "行政职务": "理化分析部部长", "技术职称/学历": "高级工程师", "移动电话": "13732119078", "地区": "宁波市", "电子邮箱": "shufenzhang1128@163.com", "专业领域": "食品及相关产品中食品添加剂、非法添加物及有毒有害物质检测技术的研究开发工作。", "专家组": "专用装备", "技术领域": "检验检测", "专家类型": "技术类专家" },
        { "姓名": "张亿储", "工作单位": "宁波乐惠国际工程装备股份有限公司", "行政职务": "啤酒事业部副总经理、公司研究院院长兼技术总监", "技术职称/学历": "高级工程师", "移动电话": "13805867408", "地区": "宁波市", "电子邮箱": "zyc@lehui.com", "专业领域": "一直从事啤酒饮料工程装备的设计与研发工作，并具有多年主持新产品开发的经验", "专家组": "专用装备", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "张俊峰", "工作单位": "宁波欣达印刷机器有限公司", "行政职务": "技术部部长", "技术职称/学历": "高级工程师", "移动电话": "18606878590", "地区": "宁波市", "电子邮箱": "zhangjf@nbxd.com", "专业领域": "印刷包装机械研发制造", "专家组": "专用装备", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "张先平", "工作单位": "宁波萨瑞通讯有限公司", "行政职务": "总经理", "技术职称/学历": "高级工程师", "移动电话": "13958259273", "地区": "宁波市", "电子邮箱": "zhangxianping@sagereal.com", "专业领域": "通讯电子终端应用", "专家组": "工业物联网,集成电路", "技术领域": "软件信息服务,新一代信息技术", "专家类型": "技术类专家" },
        { "姓名": "张发饶", "工作单位": "宁波能之光新材料科技股份有限公司", "行政职务": "董事长兼总经理", "技术职称/学历": "教授级高级工程师", "移动电话": "13605745698", "地区": "宁波市", "电子邮箱": "zfarao@materchem.com", "专业领域": "化工冶金、新材料", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "张国鹏", "工作单位": "宁波高新区甬晶微电子有限公司", "行政职务": "总工程师", "技术职称/学历": "高级工程师", "移动电话": "13386608930", "地区": "宁波市", "电子邮箱": "2207306796@qq.com", "专业领域": "微电子、电子、软件、人工智能、智能制造", "专家组": "专用装备,光学电子,工业物联网,集成电路", "技术领域": "节能环保,海洋高技术,家用电器,时尚纺织服装,软件信息服务", "专家类型": "技术类专家" },
        { "姓名": "张国龙", "工作单位": "海曙区经济和信息化局", "行政职务": "副局长", "移动电话": "13777005111", "地区": "宁波市", "电子邮箱": "280158568@qq.com", "专家类型": "政府部门专家" },
        { "姓名": "张学彬", "工作单位": "宁波市产品质量监督检验研究院", "技术职称/学历": "高工", "移动电话": "13454717363", "地区": "宁波市", "电子邮箱": "xuebinzhang2004@126.com", "专业领域": "材料学", "专家组": "高端金属合金材料", "技术领域": "检验检测,新材料", "专家类型": "技术类专家" },
        { "姓名": "张小岩", "工作单位": "宁波大榭开发区天正模具有限公司", "行政职务": "董事长", "移动电话": "13586855888", "地区": "宁波市", "电子邮箱": "tony@tzmc.com", "专业领域": "压铸模具结构、抽真空模具及压铸件成型研究", "专家组": "专用装备", "技术领域": "高端装备", "专家类型": "行业类专家" },
        { "姓名": "张平", "工作单位": "宁波波尔管业开发有限公司", "行政职务": "总经理", "技术职称/学历": "高工", "移动电话": "13906615825", "地区": "宁波市", "电子邮箱": "Mero319@126.com", "专业领域": "材料工程", "技术领域": "清洁能源,绿色石化,检验检测,科技服务,新材料", "专家类型": "技术类专家" },
        { "姓名": "张建国", "工作单位": "宁波工程学院", "技术职称/学历": "副教授", "移动电话": "13957420605", "地区": "宁波市", "电子邮箱": "2051392363@qq.com", "专业领域": "电气自动化", "专家组": "专用装备", "技术领域": "高端装备,检验检测,科技服务", "专家类型": "技术类专家" },
        { "姓名": "张承宁", "工作单位": "宁波韵升智能技术有限公司", "技术职称/学历": "高级工程师", "移动电话": "15958275980", "地区": "宁波市", "专业领域": "工业检测", "技术领域": "检验检测", "专家类型": "技术类专家" },
        { "姓名": "张提成", "工作单位": "宁波如意股份有限公司", "行政职务": "总工程师", "技术职称/学历": "教授级高级工程师", "移动电话": "13566551210", "地区": "宁波市", "电子邮箱": "ztc01@126.com", "专业领域": "先进制造与自动化领域", "专家组": "专用装备,工业物联网", "技术领域": "高端装备,新材料,工业创新设计", "专家类型": "技术类专家" },
        { "姓名": "张敬良", "工作单位": "宁波韦尔德斯凯勒智能科技有限公司", "行政职务": "研究所所长", "移动电话": "13777250289", "地区": "宁波市", "电子邮箱": "free.netbird@gmail.com", "专业领域": "自动控制和嵌入式控制", "技术领域": "高端装备", "专家类型": "行业类专家" },
        { "姓名": "张文武", "工作单位": "中国科学院宁波材料技术与工程研究所", "行政职务": "副所长", "技术职称/学历": "高级研究员", "移动电话": "15906509608", "地区": "宁波市", "专业领域": "高速度高精度多尺度加工研究、智能能量场制造与创新方法", "技术领域": "工业创新设计", "专家类型": "技术类专家" },
        { "姓名": "张斌", "工作单位": "慈兴集团有限公司", "技术职称/学历": "高级工程师", "移动电话": "17706748980", "地区": "宁波市", "电子邮箱": "zhangbin@cwbearing.com.cn", "专家组": "专用装备,关键基础件", "专家类型": "技术类专家" },
        { "姓名": "张日红", "工作单位": "中淳高科桩业股份有限公司", "行政职务": "副总裁", "技术职称/学历": "教授级高工", "移动电话": "13685834222", "地区": "宁波市", "电子邮箱": "zhangrh@zcone.com.cn", "专业领域": "系统工程", "技术领域": "海洋高技术,新材料", "专家类型": "技术类专家" },
        { "姓名": "张柏权", "工作单位": "慈溪市广播电视台", "技术职称/学历": "教授级高级工程师", "移动电话": "13805818033", "地区": "宁波市", "电子邮箱": "cxzbq@126.com", "专业领域": "电子技术广播电视系统工程技术", "专家组": "光学电子", "技术领域": "节能环保", "专家类型": "技术类专家" },
        { "姓名": "张正来", "工作单位": "浙江华朔科技股份有限公司", "行政职务": "副总经理兼总工程师", "技术职称/学历": "高级工程师", "移动电话": "15857492866", "地区": "宁波市", "电子邮箱": "Zhangzhenglai197@sohu.com", "专业领域": "压铸模具设计制造、压铸工艺及自动化、精密模具材料、精密加工技术", "专家组": "高端金属合金材料,关键基础件", "技术领域": "汽车制造,新材料", "专家类型": "技术类专家" },
        { "姓名": "张永平", "工作单位": "宁波工程学院", "技术职称/学历": "教授", "移动电话": "15888039099", "地区": "宁波市", "专业领域": "机器人应用技术与装配生产线自动化改造、智能控制与检测装置", "专家组": "专用装备", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "张永彤", "工作单位": "宁波市科技局", "行政职务": "处长", "移动电话": "13858220988", "地区": "宁波市", "专家组": "智能制造,集成电路", "专家类型": "政府部门专家" },
        { "姓名": "张波杰", "工作单位": "宁波斯贝科技缸套有限公司", "行政职务": "总经理", "移动电话": "13566360585", "地区": "宁波市", "电子邮箱": "zhangbojie@china-spey.com", "专业领域": "主要从事研究压铸及机加工、夹具类的设计制作", "技术领域": "汽车制造", "专家类型": "行业类专家" },
        { "姓名": "张祎", "工作单位": "宁波勋辉电器有限公司", "行政职务": "总经理", "技术职称/学历": "教授级高级工程师", "移动电话": "13456124235", "地区": "宁波市", "电子邮箱": "Zhangyi6603@126.com", "专业领域": "压铸模具，铝、镁、锌合金压铸及机械加工，镁合金溶化保温炉设计制造；汽车零件、客车设计制造；自动化设备设计改造；新型合金材料研究应用", "专家组": "关键基础件,稀土磁性材料,高端金属合金材料", "技术领域": "汽车制造,高端装备,新材料", "专家类型": "技术类专家" },
        { "姓名": "张策", "工作单位": "宁波华液机器制造有限公司", "行政职务": "副总经理", "技术职称/学历": "高级工程师", "移动电话": "13858272981", "地区": "宁波市", "专业领域": "机电控制工程（流体传统与控制）", "专家类型": "技术类专家" },
        { "姓名": "张继平", "工作单位": "浙江中之杰软件技术有限公司", "行政职务": "董事长", "技术职称/学历": "高级工程师", "移动电话": "18957497221", "地区": "宁波市", "专业领域": "两化融合，企业信息化管理，信息系统集成", "专家组": "集成电路,工业物联网", "技术领域": "软件信息服务", "专家类型": "技术类专家" },
        { "姓名": "张蓉", "工作单位": "宁波捷豹集团有限公司", "技术职称/学历": "高级工程师", "移动电话": "13516788972", "地区": "宁波市", "电子邮箱": "zhangyueen@hotmail.com/zhangrong@jiebaogroup.cn", "专业领域": "化工、橡胶配方、传动带及其工艺", "专家组": "关键基础件", "技术领域": "汽车制造,新材料", "专家类型": "技术类专家" },
        { "姓名": "张远明", "工作单位": "中国科学院宁波材料技术与工程研究所", "技术职称/学历": "教授级高级工程师", "移动电话": "15058291186", "地区": "宁波市", "专业领域": "先进增材制造技术", "专家类型": "技术类专家" },
        { "姓名": "张钜铨", "工作单位": "宁波飞图自动技术有限公司", "行政职务": "技术总监", "移动电话": "17757453378", "地区": "宁波市", "专家类型": "行业类专家" },
        { "姓名": "张驰", "工作单位": "中国科学院宁波工业技术研究院", "技术职称/学历": "教授级高级工程师,研究员", "移动电话": "15168586753", "地区": "宁波市", "电子邮箱": "zhangchi@nimte.ac.cn", "专业领域": "工业自动化", "专家组": "智能制造,工业物联网", "技术领域": "工业创新设计", "专家类型": "技术类专家" },
        { "姓名": "徐云", "工作单位": "宁波市经济和信息化委员会", "行政职务": "副书记", "移动电话": "13506880501", "地区": "宁波市", "专家组": "智能制造,集成电路", "专家类型": "政府部门专家" },
        { "姓名": "徐宝学", "工作单位": "万华化学（宁波）有限公司", "行政职务": "总工程师", "技术职称/学历": "教授级高级工程师", "移动电话": "13221907728", "地区": "宁波市", "电子邮箱": "bxxu@whchem.com", "专业领域": "化学工程、新材料工艺技术开发", "技术领域": "新材料", "专家类型": "技术类专家" },
        { "姓名": "徐生", "工作单位": "浙江工商职业技术学院", "行政职务": "副院长", "技术职称/学历": "副教授", "移动电话": "13957405001", "地区": "宁波市", "电子邮箱": "xusean@126.com", "专业领域": "机械电子工程", "专家组": "关键基础件,专用装备", "技术领域": "汽车制造,高端装备,工业创新设计", "专家类型": "技术类专家" },
        { "姓名": "惠伟安", "工作单位": "国家气动产品质量监督检验中心", "技术职称/学历": "高级工程师", "移动电话": "15258112634", "地区": "宁波市", "专业领域": "流体机械及工程", "专家组": "关键基础件", "技术领域": "检验检测", "专家类型": "技术类专家" },
        { "姓名": "方强", "工作单位": "浙江大学", "行政职务": "副主任", "技术职称/学历": "研究员", "移动电话": "13675833875", "地区": "杭州市", "专业领域": "伺服控制，飞机数字装配技术", "专家组": "关键基础件", "专家类型": "技术类专家" },
        { "姓名": "方灶军", "工作单位": "中国科学院宁波材料技术与工程研究所", "技术职称/学历": "研究员", "移动电话": "18067396819", "地区": "宁波市", "电子邮箱": "fangzaojun@nimte.ac.cn", "专业领域": "高端装备中的智能制造装备", "专家组": "专用装备,集成电路", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "施红伟", "工作单位": "宁波飞图自动技术有限公司", "行政职务": "总经理", "移动电话": "13335849966", "地区": "宁波市", "专业领域": "机械设计", "专家类型": "行业类专家" },
        { "姓名": "施红文", "工作单位": "宁波飞图自动技术有限公司", "行政职务": "董事长", "移动电话": "13605848007", "地区": "宁波市", "专家类型": "行业类专家" },
        { "姓名": "曹忠伟", "工作单位": "宁波永发集团有限公司", "行政职务": "副总经理", "技术职称/学历": "高级工程师", "移动电话": "13906843073", "地区": "宁波市", "专业领域": "机电一体化", "专家组": "智能制造", "专家类型": "技术类专家" },
        { "姓名": "曹衍龙", "工作单位": "浙江大学", "技术职称/学历": "教授", "移动电话": "13357102880", "地区": "杭州市", "专业领域": "机械制造及其自动化", "专家类型": "技术类专家" },
        { "姓名": "曹鸿涛", "工作单位": "中国科学院宁波材料技术与工程研究所", "技术职称/学历": "研究员", "移动电话": "13819424608", "地区": "宁波市", "电子邮箱": "h_cao@nimte.ac.cn", "专业领域": "材料学", "专家组": "关键基础件,光学电子", "技术领域": "节能环保,新材料", "专家类型": "技术类专家" },
        { "姓名": "朱伟", "工作单位": "乐歌人体工学科技股份有限公司", "技术职称/学历": "注册会计师", "移动电话": "13566334684", "地区": "宁波市", "专家组": "专用装备", "技术领域": "汽车制造,高端装备,新材料", "专家类型": "财务类专家" },
        { "姓名": "朱少岚", "工作单位": "宁波傲视智绘光电科技有限公司", "行政职务": "董事长兼总经理", "技术职称/学历": "研究员", "移动电话": "18268696611", "地区": "宁波市", "电子邮箱": "zhushaolan@osighttech.com", "专业领域": "激光成像雷达技术及相关应用", "专家组": "光学电子", "技术领域": "高端装备,新一代信息技术", "专家类型": "技术类专家" },
        { "姓名": "朱建军", "工作单位": "宁波保税区（出口加工区）经济发展局", "行政职务": "副局长", "移动电话": "13777227711", "地区": "宁波市", "电子邮箱": "zjjun@nftz.gov.cn", "专家类型": "政府部门专家" },
        { "姓名": "朱炜炜", "工作单位": "宁波天瑞精工机械有限公司", "行政职务": "副总经理", "技术职称/学历": "国家注册审核员", "移动电话": "13566388811", "地区": "宁波市", "电子邮箱": "zww@skymaster.com.cn", "专业领域": "智能制造实施工厂内信息化、精益化推行与指导", "专家组": "专用装备", "技术领域": "高端装备", "专家类型": "行业类专家" },
        { "姓名": "朱留存", "工作单位": "爱理科机器人", "技术职称/学历": "教授级高级工程师", "移动电话": "15356086831", "地区": "宁波市", "专业领域": "机器人与自动化", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "朱秀荣", "工作单位": "兵器科学研究院宁波分院", "行政职务": "总工程师", "技术职称/学历": "研究员", "移动电话": "13857870922", "地区": "宁波市", "电子邮箱": "Zxr0922@163.com", "专业领域": "高端金属合金材料", "专家组": "高端金属合金材料", "技术领域": "新材料", "专家类型": "技术类专家" },
        { "姓名": "朱立洲", "工作单位": "宁波江宸智能装备股份有限公司", "行政职务": "董事长", "技术职称/学历": "董事长", "移动电话": "18867631188", "地区": "宁波市", "电子邮箱": "zhulzh@dingtalk.com", "专业领域": "智能制造装备", "专家组": "智能制造", "专家类型": "行业类专家" },
        { "姓名": "朱锦", "工作单位": "中国科学院宁波材料技术与工程研究所", "技术职称/学历": "研究员", "移动电话": "15958276797", "地区": "宁波市", "电子邮箱": "jzhu@nimte.ac.cn", "专业领域": "有机化学与高分子", "技术领域": "新材料", "专家类型": "技术类专家" },
        { "姓名": "李伟斌", "工作单位": "宁波精达成型装备股份有限公司", "技术职称/学历": "高级工程师", "移动电话": "13566047306", "地区": "宁波市", "专业领域": "机械设计", "技术领域": "工业创新设计", "专家类型": "技术类专家" },
        { "姓名": "李司强", "工作单位": "浙江德威会计师事务所有限公司", "技术职称/学历": "注册会计师", "移动电话": "13777020939", "地区": "宁波市", "专业领域": "担保", "专家类型": "财务类专家" },
        { "姓名": "李国卫", "工作单位": "浙江和惠照明科技有限公司", "技术职称/学历": "高级经济师", "移动电话": "13566093688", "地区": "宁波市", "电子邮箱": "519547992@qq.com", "专业领域": "经济类", "专家组": "集成电路,光学电子", "技术领域": "节能环保,新一代信息技术", "专家类型": "财务类专家" },
        { "姓名": "李宪斌", "工作单位": "宁波汽车零部件检测有限公司", "技术职称/学历": "高级工程师", "移动电话": "15888096262", "地区": "宁波市", "电子邮箱": "lixianbin@catarc.ac.cn", "专业领域": "汽车运用工程", "技术领域": "汽车制造,检验检测", "专家类型": "技术类专家" },
        { "姓名": "李方园", "工作单位": "浙江工商职业技术学院", "行政职务": "智能电子学院副院长", "技术职称/学历": "高级工程师", "移动电话": "13306696894", "地区": "宁波市", "电子邮箱": "961044383@qq.com", "专业领域": "电气工程及自动化", "专家组": "工业物联网", "技术领域": "节能环保", "专家类型": "技术类专家" },
        { "姓名": "李明", "工作单位": "宁波科星材料科技有限公司", "行政职务": "工程技术中心副主任", "技术职称/学历": "博士", "移动电话": "15257496887", "地区": "宁波市", "电子邮箱": "ming21tian@126.com", "专业领域": "材料物理与化学", "专家组": "稀土磁性材料", "专家类型": "技术类专家" },
        { "姓名": "李智军", "工作单位": "宁波更大集团有限公司", "行政职务": "制造总监", "技术职称/学历": "制造总监", "移动电话": "13567416651", "地区": "宁波市", "电子邮箱": "lzj@ngtb.cn", "专业领域": "高端装备中的智能制造装备,智能制造工程", "专家组": "智能制造,专用装备", "技术领域": "高端装备", "专家类型": "行业类专家" },
        { "姓名": "李玲", "工作单位": "库柏（宁波）电气有限公司", "行政职务": "研发经理", "技术职称/学历": "高级工程师", "移动电话": "13968250001", "地区": "宁波市", "电子邮箱": "Lisali2@eaton.com", "专业领域": "电气工程及其自动化", "专家组": "集成电路,石墨烯,专用装备,关键基础件", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "李百炼", "工作单位": "宁波帕沃尔精密液压机械有限公司", "行政职务": "总经理", "技术职称/学历": "高级工程师", "移动电话": "13819888056", "地区": "宁波市", "电子邮箱": "Libailianzooo@163.com", "专业领域": "机械制造工艺及设备", "专家组": "专用装备", "技术领域": "汽车制造,高端装备", "专家类型": "技术类专家" },
        { "姓名": "李立军", "工作单位": "宁波慈星股份有限公司", "行政职务": "副总", "技术职称/学历": "高级工程师", "移动电话": "13738029988", "地区": "宁波市", "电子邮箱": "jimbolee@qq.com", "专业领域": "智能制造、机器人、人工智能", "专家组": "专用装备,工业物联网,智能制造", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "李萌", "工作单位": "宁波富乐礼机器人科技有限公司", "行政职务": "总经理助理", "技术职称/学历": "博士", "移动电话": "18868602080", "地区": "宁波市", "电子邮箱": "limeng@flexsys-robotics.com", "专业领域": "光机电算一体化专业背景、智能设备、智能仪器设计研发", "专家组": "专用装备,工业物联网", "技术领域": "汽车制造,高端装备,检验检测,科技服务", "专家类型": "技术类专家" },
        { "姓名": "李进", "工作单位": "浙江力创自动化科技有限公司", "行政职务": "总经理", "技术职称/学历": "高级技师", "移动电话": "13386614057", "地区": "宁波市", "电子邮箱": "cixilc@163.com", "专业领域": "自动化系", "专家组": "光学电子,专用装备,工业物联网,关键基础件,集成电路", "技术领域": "高端装备,新一代信息技术", "专家类型": "行业类专家" },
        { "姓名": "李钢", "工作单位": "宁波世明会计师事务所有限公司", "技术职称/学历": "注册会计师", "移动电话": "13805846748", "地区": "宁波市", "专业领域": "担保", "专家类型": "财务类专家" },
        { "姓名": "杜娟", "工作单位": "中国科学院宁波材料技术与工程研究所", "技术职称/学历": "研究员", "移动电话": "15067455056", "地区": "宁波市", "电子邮箱": "jdu-case@hotmail.com", "专业领域": "磁性、纳米材料", "专家组": "关键基础件", "技术领域": "新材料", "专家类型": "技术类专家" },
        { "姓名": "杜明", "工作单位": "宁波继明电器有限公司", "技术职称/学历": "高级经济师", "移动电话": "13968354668", "地区": "宁波市", "专业领域": "工业物联网", "专家组": "工业物联网", "技术领域": "软件信息服务", "专家类型": "技术类专家" },
        { "姓名": "杜林新", "工作单位": "宁波双林汽车部件股份有限公司", "技术职称/学历": "高级工程师", "移动电话": "18069229292", "地区": "宁波市", "电子邮箱": "lxdu@shuanglin.com", "专业领域": "汽车电子产品", "技术领域": "汽车制造", "专家类型": "技术类专家" },
        { "姓名": "杨亚威", "工作单位": "中国科学院宁波工业技术研究院", "技术职称/学历": "教授级高级工程师,研究员", "移动电话": "13386645086", "地区": "宁波市", "专业领域": "机器人及自动化", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "杨倩红", "工作单位": "宁波市经济和信息化委员会", "行政职务": "副处长", "移动电话": "13615883161", "地区": "宁波市", "专家组": "智能制造,集成电路", "专家类型": "政府部门专家" },
        { "姓名": "杨明辉", "工作单位": "中国科学院宁波材料技术与工程研究所", "行政职务": "材料研究组组长", "技术职称/学历": "研究员", "移动电话": "13889609198", "地区": "宁波市", "电子邮箱": "myang@nimte.ac.cn", "专业领域": "材料化学", "专家组": "关键基础件,光学电子", "技术领域": "新材料", "专家类型": "技术类专家" },
        { "姓名": "杨晔", "工作单位": "中科院宁波材料技术与工程研究所", "技术职称/学历": "研究员", "移动电话": "13615743630", "地区": "宁波市", "电子邮箱": "yangye@nimte.ac.cn", "专业领域": "凝聚态物理", "专家组": "光学电子", "技术领域": "节能环保,清洁能源,新材料", "专家类型": "技术类专家" },
        { "姓名": "杨桂林", "工作单位": "中科院宁波工业技术学院，先进制造技术研究所", "行政职务": "所长", "技术职称/学历": "高级研究员", "移动电话": "13506692527", "地区": "宁波市", "专业领域": "机器人与智能制造技术", "专家组": "智能制造", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "林健", "工作单位": "浙江钧普科技股份有限公司", "行政职务": "总经理", "技术职称/学历": "总经理", "移动电话": "13501727301", "地区": "宁波市", "专业领域": "RFID/物联网智能产品及解决方案", "专家组": "集成电路,工业物联网,智能制造", "技术领域": "新一代信息技术", "专家类型": "行业类专家" },
        { "姓名": "林勇", "工作单位": "宁波龙欣化工集团", "行政职务": "副总经理", "技术职称/学历": "高级工程师", "移动电话": "13806665894", "地区": "宁波市", "电子邮箱": "linyong30@126.com", "专业领域": "化工新材料", "技术领域": "绿色石化,新材料", "专家类型": "技术类专家" },
        { "姓名": "林国峰", "工作单位": "宁波旭升汽车技术股份有限公司", "行政职务": "副董事长", "技术职称/学历": "副董事长", "移动电话": "13685700018", "地区": "宁波市", "电子邮箱": "xuskf@nbxus.com", "专业领域": "高端装备中的智能制造装备、智能制造工程", "专家组": "关键基础件,专用装备,工业物联网", "技术领域": "汽车制造,高端装备", "专家类型": "行业类专家" },
        { "姓名": "林水明", "工作单位": "宁波萨瑞通讯有限公司", "行政职务": "硬件专家", "技术职称/学历": "高级工程师", "移动电话": "13780046467", "地区": "宁波市", "电子邮箱": "linshuiming@sagereal.com", "专业领域": "终端硬件开发设计", "专家组": "集成电路,工业物联网", "技术领域": "软件信息服务,新一代信息技术", "专家类型": "技术类专家" },
        { "姓名": "林薛刚", "工作单位": "宁波智畅机器人系统有限公司", "行政职务": "总经理", "移动电话": "18800008843", "地区": "宁波市", "专业领域": "先进制造技术", "专家类型": "行业类专家" },
        { "姓名": "梁云", "工作单位": "浙江钰烯腐蚀控制股份有限公司", "行政职务": "化工机械", "移动电话": "15058822450", "地区": "宁波市", "电子邮箱": "liangyun@yuxicorrosion.com", "技术领域": "检验检测,新材料", "专家类型": "行业类专家" },
        { "姓名": "梁海", "工作单位": "浙江启鑫新能源科技股份有限公司", "行政职务": "副总经理", "移动电话": "13957800379", "地区": "宁波市", "电子邮箱": "toby@nbqxsolar.com", "专业领域": "机械", "技术领域": "节能环保,清洁能源,新材料", "专家类型": "行业类专家" },
        { "姓名": "樊铭政", "工作单位": "慈溪市创诚银河软件有限公司宁波欧讯企业管理咨询有限公司", "行政职务": "总经理", "移动电话": "18606606136", "地区": "宁波市", "电子邮箱": "27805810@qq.com", "专业领域": "MES、供应商协同、企业管理咨询、精益生产咨询及软件系统、卓越绩效咨询及软件系统", "专家组": "工业物联网", "技术领域": "软件信息服务", "专家类型": "行业类专家" },
        { "姓名": "欧阳孟余", "工作单位": "宁波汽车零部件检测有限公司", "行政职务": "副总经理", "技术职称/学历": "高级工程师", "移动电话": "13857407998", "地区": "宁波市", "电子邮箱": "ouyangmengyu@catarc.ac.cn", "技术领域": "汽车制造", "专家类型": "技术类专家" },
        { "姓名": "欧阳道生", "工作单位": "宁波天安智能电网科技股份有限公司", "行政职务": "研发部经理", "技术职称/学历": "高级工程师", "移动电话": "13968398892", "地区": "宁波市", "专业领域": "智能电网、电力系统自动化、智能电器", "专家类型": "技术类专家" },
        { "姓名": "段景宽", "工作单位": "宁波工程学院", "技术职称/学历": "高级工程师", "移动电话": "13805872504", "地区": "宁波市", "电子邮箱": "jkduan@alumni.sjtu.edu.cn", "专业领域": "高分子材料", "专家组": "石墨烯", "技术领域": "绿色石化,新材料", "专家类型": "技术类专家" },
        { "姓名": "江南", "工作单位": "中国科学院宁波材料技术与工程研究所", "技术职称/学历": "研究员", "移动电话": "13819849234", "地区": "宁波市", "电子邮箱": "jiangnan@nimte.ac.cn", "专业领域": "材料物性及器件", "专家组": "高端金属合金材料", "技术领域": "新材料", "专家类型": "技术类专家" },
        { "姓名": "汤杰", "工作单位": "宁波中大力德智能传动股份有限公司", "行政职务": "技术副总", "技术职称/学历": "研究员级高级工程师", "移动电话": "13968286737", "地区": "宁波市", "专业领域": "电机", "专家组": "关键基础件", "专家类型": "技术类专家" },
        { "姓名": "汪虹", "工作单位": "宁波市汽车零部件产业协会", "行政职务": "秘书长", "技术职称/学历": "高级经济师", "移动电话": "13805872993", "地区": "宁波市", "电子邮箱": "waubrey@126.com", "专业领域": "汽车及零部件", "专家组": "关键基础件,专用装备", "技术领域": "汽车制造,高端装备", "专家类型": "技术类专家" },
        { "姓名": "汪鹏君", "工作单位": "宁波大学信息科学与工程学院", "行政职务": "处长", "技术职称/学历": "教授", "移动电话": "13857476898", "地区": "宁波市", "电子邮箱": "wangpengjun@nbu.edu.cn", "专业领域": "集成电路产品设计,集成电路设计技术及设计软件工具开发", "专家组": "集成电路,集成电路", "专家类型": "技术类专家" },
        { "姓名": "沈坚", "工作单位": "宁波市食品检验检测研究院", "行政职务": "副院长", "技术职称/学历": "高级工程师", "移动电话": "13805841749", "地区": "宁波市", "电子邮箱": "Shenjian2@yeah.net", "专业领域": "食品检验", "技术领域": "检验检测", "专家类型": "技术类专家" },
        { "姓名": "沈洪垚", "工作单位": "浙江大学", "技术职称/学历": "副教授", "移动电话": "13575467321", "地区": "杭州市", "专业领域": "数控加工、智能制造、三维打印", "技术领域": "工业创新设计", "专家类型": "技术类专家" },
        { "姓名": "洪崚", "工作单位": "博格华纳汽车零部件（宁波）有限公司", "行政职务": "高级前期制造工程部经理", "移动电话": "15888191869", "地区": "宁波市", "电子邮箱": "lhong@bunitNamewarner.com", "专业领域": "精密汽车零部件生产线开发及智能制造", "专家组": "专用装备", "技术领域": "汽车制造", "专家类型": "行业类专家" },
        { "姓名": "洪立", "工作单位": "宁波工程学院", "技术职称/学历": "高级工程师", "移动电话": "13806679706", "地区": "宁波市", "电子邮箱": "2051392363@qq.com", "专业领域": "软件工程、项目管理", "专家组": "工业物联网", "技术领域": "软件信息服务,新一代信息技术", "专家类型": "技术类专家" },
        { "姓名": "温原", "工作单位": "浙江瑞堂塑料科技有限公司", "行政职务": "总经理", "移动电话": "13777220928", "地区": "宁波市", "电子邮箱": "10258@163.com", "专业领域": "精细化工", "技术领域": "新材料", "专家类型": "行业类专家" },
        { "姓名": "潘今一", "工作单位": "宁波沧泓智能科技有限公司", "行政职务": "董事长", "技术职称/学历": "博士研究生导师", "移动电话": "13501980927", "地区": "宁波市", "专业领域": "机器视觉、人工智能、光通讯", "专家类型": "行业类专家" },
        { "姓名": "潘全旺", "工作单位": "宁波科元塑胶有限公司", "行政职务": "副总经理/总工程师", "技术职称/学历": "高级工程师", "移动电话": "15867285944", "地区": "宁波市", "电子邮箱": "panqw@krcc.cn", "专业领域": "石油化工  精细化工  高分子材料", "技术领域": "绿色石化", "专家类型": "技术类专家" },
        { "姓名": "潘式正", "工作单位": "宁波欣达（集团）有限公司", "行政职务": "总工程师", "技术职称/学历": "高级工程师", "移动电话": "13082910683", "地区": "宁波市", "电子邮箱": "xz@nbxd.com", "专业领域": "电机设计制造", "专家组": "专用装备", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "潘舜乔", "工作单位": "宁波科信会计师事务所有限公司", "技术职称/学历": "注册会计师", "移动电话": "13056759779", "地区": "宁波市", "专家类型": "财务类专家" },
        { "姓名": "焦俊科", "工作单位": "中国科学院宁波材料技术与工程研究所", "技术职称/学历": "高级工程师", "移动电话": "15867463921", "地区": "宁波市", "电子邮箱": "jiaojunke@nimte.ac.cn", "专业领域": "激光先进制造技术、激光加工技术及设备开发", "专家组": "光学电子,专用装备", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "熊志勇", "工作单位": "宁波敏实汽车零部件技术研发有限公司", "行政职务": "自动化总监", "移动电话": "13958322152", "地区": "宁波市", "电子邮箱": "zhiyong.xiong@minthgroup.com", "专业领域": "机器人应用、数控技术应用、系统集成", "专家组": "专用装备,集成电路", "技术领域": "汽车制造", "专家类型": "行业类专家" },
        { "姓名": "王全林", "工作单位": "宁波市产品质量监督检验研究院", "行政职务": "副院长", "技术职称/学历": "教授级高工", "移动电话": "13738427529", "地区": "宁波市", "电子邮箱": "quanlinwang@163.com", "专业领域": "物理化学", "技术领域": "绿色石化,检验检测,新材料", "专家类型": "技术类专家" },
        { "姓名": "王刚", "工作单位": "宁波韵升股份有限公司", "行政职务": "总经理", "技术职称/学历": "副教授,高级工程师", "移动电话": "13566059961", "地区": "宁波市", "电子邮箱": "wangg@ysweb.com", "专业领域": "机器视觉智能装备集成", "专家组": "智能制造,专用装备", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "王刚", "工作单位": "宁波弘讯工程咨询有限公司", "行政职务": "总经理", "技术职称/学历": "高级工程师", "移动电话": "13567845472", "地区": "宁波市", "电子邮箱": "765322426@qq.com", "专家组": "专用装备,高端金属合金材料,关键基础件", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "王建中", "工作单位": "宁波摩米战略中心主任", "行政职务": "主任", "技术职称/学历": "研究员", "移动电话": "13606788395", "地区": "宁波市", "专业领域": "机械自动化", "专家类型": "技术类专家" },
        { "姓名": "王建华", "工作单位": "宁波华盛鑫泰机床有限公司", "行政职务": "总经理", "技术职称/学历": "技师", "移动电话": "13071988618", "地区": "宁波市", "电子邮箱": "976910766@qq.com", "专业领域": "机械", "专家类型": "行业类专家" },
        { "姓名": "王建锋", "工作单位": "慈溪市联创软件有限公司", "行政职务": "总经理", "移动电话": "13586610601", "地区": "宁波市", "电子邮箱": "Wjf_97@163.com", "专业领域": "信息化管理、MES", "专家组": "工业物联网", "技术领域": "软件信息服务", "专家类型": "行业类专家" },
        { "姓名": "王得胜", "工作单位": "富诚汽车零部件有限公司", "行政职务": "副总监", "技术职称/学历": "高级工程师", "移动电话": "13606592121", "地区": "宁波市", "电子邮箱": "wds126@126.com", "专业领域": "模具设计与制造", "技术领域": "家用电器,汽车制造,工业创新设计", "专家类型": "技术类专家" },
        { "姓名": "王文明", "工作单位": "中国兵器科学研究院宁波分院", "行政职务": "副总工程师", "技术职称/学历": "研究员", "移动电话": "13566305971", "地区": "宁波市", "电子邮箱": "13566305971@139.com", "专业领域": "高端装备中的智能制造装备", "专家组": "专用装备", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "王斌", "工作单位": "宁波市江北区经济和信息化局", "行政职务": "副局长", "移动电话": "13906687891", "地区": "宁波市", "电子邮箱": "datoo@sina.co", "专家类型": "政府部门专家" },
        { "姓名": "王新龙", "工作单位": "宁波新思创机电科技股份有限公司", "行政职务": "总经理", "技术职称/学历": "博士", "移动电话": "18667832200", "地区": "宁波市", "电子邮箱": "12427414@qq.com", "专业领域": "计算机图形学、科学计算可视化和图形图像仿真及电驱动等领域", "专家类型": "技术类专家" },
        { "姓名": "王旭东", "工作单位": "宁波和信制药设备有限公司", "行政职务": "总工程师", "移动电话": "18857462888", "地区": "宁波市", "电子邮箱": "573807321@qq.com", "专业领域": "医用水处理设备制造、机修钳工技术工艺", "专家组": "专用装备", "技术领域": "节能环保", "专家类型": "行业类专家" },
        { "姓名": "王春涛", "工作单位": "宁波合力模具科技股份有限公司", "行政职务": "技术中心经理", "移动电话": "18958398080", "地区": "宁波市", "电子邮箱": "wct_brow@helimould.com", "专业领域": "材料成型（铸造、压铸方向）；技术管理；材料", "专家组": "关键基础件", "技术领域": "高端装备", "专家类型": "行业类专家" },
        { "姓名": "王朝阳", "工作单位": "宁波华成阀门有限公司", "技术职称/学历": "教授级高级工程师", "移动电话": "15888554080", "地区": "宁波市", "电子邮箱": "278675732@qq.com", "专业领域": "机械设计与制造", "专家组": "关键基础件", "专家类型": "技术类专家" },
        { "姓名": "王洋定", "工作单位": "宁波市产品质量监督检验研究院", "行政职务": "院长", "技术职称/学历": "高级工程师", "移动电话": "13957800080", "地区": "宁波市", "专业领域": "机电一体化工程", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "王滕滕", "工作单位": "宁波裕江特种胶带有限公司", "移动电话": "18758498667", "地区": "宁波市", "电子邮箱": "wangtengtengzhou@126.com", "专业领域": "材料加工工程", "技术领域": "汽车制造,新材料", "专家类型": "行业类专家" },
        { "姓名": "王立平", "工作单位": "中国科学院宁波材料技术与工程研究所", "行政职务": "实验室主任", "技术职称/学历": "研究员", "移动电话": "13819849234", "地区": "宁波市", "电子邮箱": "jiangnan@nimte.ac.cn", "专业领域": "海洋新材料", "技术领域": "海洋高技术,新材料", "专家类型": "技术类专家" },
        { "姓名": "王耀", "工作单位": "宁波明科机电有限公司", "行政职务": "总经理", "技术职称/学历": "高级工程师", "移动电话": "13306696781", "地区": "宁波市", "电子邮箱": "wangy@mk-china.net", "专业领域": "集成电路产品设计,集成电路测试", "专家组": "集成电路", "专家类型": "技术类专家" },
        { "姓名": "王鸿龙", "工作单位": "宁波芯空间集成电路有限公司", "技术职称/学历": "高级工程师", "移动电话": "13757401520", "地区": "宁波市", "专家组": "专用装备,光学电子,关键基础件,工业物联网,集成电路", "技术领域": "高端装备,新一代信息技术,新材料", "专家类型": "技术类专家" },
        { "姓名": "甄敏", "工作单位": "宁波江丰电子材料股份有限公司", "行政职务": "信息中心总监", "技术职称/学历": "电气高级工程师", "移动电话": "15967829693", "地区": "宁波市", "电子邮箱": "min.zhen@kfmic.com", "专业领域": "企业信息化建设", "专家组": "高端金属合金材料,集成电路", "技术领域": "新材料", "专家类型": "技术类专家" },
        { "姓名": "甘中学", "工作单位": "宁波市智能制造产业研究院", "行政职务": "院长", "技术职称/学历": "国千人才", "移动电话": "13566043166", "地区": "宁波市", "电子邮箱": "zhongxuegan@126.com", "专业领域": "柔性自动化控制及能源系统控制工程技术", "专家类型": "技术类专家" },
        { "姓名": "田爽", "工作单位": "中科院宁波材料技术与工程研究所", "技术职称/学历": "正高级工程师", "移动电话": "13385740327", "地区": "宁波市", "电子邮箱": "tianshuang@nimte.ac.cn", "技术领域": "新材料", "专家类型": "技术类专家" },
        { "姓名": "畅丽君", "工作单位": "宁波中科莱恩机器人有限公司", "移动电话": "13603004631", "地区": "宁波市", "电子邮箱": "teresacho@163.com", "专业领域": "智能冲压工业机器人", "专家组": "专用装备", "技术领域": "高端装备", "专家类型": "行业类专家" },
        { "姓名": "畅志军", "工作单位": "宁波中科莱恩机器人有限公司", "行政职务": "董事长", "技术职称/学历": "国家千人计划专家", "移动电话": "13603062765", "地区": "宁波市", "电子邮箱": "choshugun@163.com", "专业领域": "高端装备、高端装备中的智能制造装备、智能制造工程", "专家组": "智能制造,专用装备", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "石东亮", "工作单位": "宁波市纤维检验所", "行政职务": "涉外业务部主任", "技术职称/学历": "教授级高工", "移动电话": "15867891199", "地区": "宁波市", "电子邮箱": "nfi8@sina.com", "专业领域": "丝绸工程", "技术领域": "时尚纺织服装,检验检测", "专家类型": "技术类专家" },
        { "姓名": "祁少芳", "工作单位": "宁波美诺华天康药业有限公司", "行政职务": "副总经理", "技术职称/学历": "高级工程师", "移动电话": "18905758281", "地区": "宁波市", "电子邮箱": "qsf@menovopharm.com", "专业领域": "制剂生产质量管理", "技术领域": "生物医药", "专家类型": "技术类专家" },
        { "姓名": "祝颖丹", "工作单位": "中国科学院宁波材料技术与工程研究所", "行政职务": "研究员", "技术职称/学历": "研究员", "移动电话": "13989380120", "地区": "宁波市", "专业领域": "复合材料装备", "专家组": "关键基础件", "技术领域": "汽车制造,高端装备,新材料", "专家类型": "技术类专家" },
        { "姓名": "秦岭", "工作单位": "宁波芯路通讯科技有限公司", "行政职务": "CEO", "技术职称/学历": "教授级高工", "移动电话": "13818079252", "地区": "宁波市", "电子邮箱": "Harry.qin@chipways.com", "专业领域": "电子信息", "技术领域": "新一代信息技术", "专家类型": "技术类专家" },
        { "姓名": "秦炜", "工作单位": "宁波新松机器人科技有限公司", "行政职务": "技术总监", "技术职称/学历": "高级工程师", "移动电话": "18626878188", "地区": "宁波市", "专业领域": "以工业机器人为主体的自动化生产线关键技术", "专家组": "集成电路", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "程晓民", "工作单位": "宁波工程学院", "技术职称/学历": "教授", "移动电话": "13805877508", "地区": "宁波市", "电子邮箱": "849074018@qq.com", "专家组": "智能制造", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "章城亮", "工作单位": "宁波大红鹰生物工程股份有限公司", "行政职务": "项目办主任", "技术职称/学历": "高级工程师", "移动电话": "15088833612", "地区": "宁波市", "电子邮箱": "123563017@qq.com", "专业领域": "医药工程 天然维生素E产品生产及研发", "技术领域": "生物医药", "专家类型": "技术类专家" },
        { "姓名": "章正", "工作单位": "宁波微科光电股份有限公司", "行政职务": "技术副总经理", "移动电话": "13957439770", "地区": "宁波市", "电子邮箱": "zz@weco.cc", "专业领域": "船舶及船厂电气自动化", "专家组": "光学电子,工业物联网", "技术领域": "新一代信息技术", "专家类型": "行业类专家" },
        { "姓名": "童群", "工作单位": "慈兴集团有限公司", "行政职务": "科技项目管理办公室主任", "技术职称/学历": "高级工程师", "移动电话": "13917716548", "地区": "宁波市", "专业领域": "机械制造领域信息化数据化应用", "专家组": "专用装备,关键基础件,智能制造", "技术领域": "汽车制造,高端装备", "专家类型": "技术类专家" },
        { "姓名": "罗京花", "工作单位": "宁波威远会计师事务所有限公司", "技术职称/学历": "注册会计师", "移动电话": "13706843731", "地区": "宁波市", "专家类型": "财务类专家" },
        { "姓名": "罗颖", "工作单位": "电子科技大学光电信息学院", "行政职务": "董事长", "技术职称/学历": "博士", "移动电话": "18111626322", "地区": "宁波市", "电子邮箱": "yingluo907@tecgoo.cn", "专业领域": "机器视觉、计算机软件及图像处理、激光应用、工业自动化", "专家组": "光学电子,专用装备", "技术领域": "高端装备,软件信息服务,检验检测,科技服务", "专家类型": "技术类专家" },
        { "姓名": "翁九星", "工作单位": "宁波舜宇智能科技有限公司", "行政职务": "总经理", "技术职称/学历": "经济师", "移动电话": "13867890269", "地区": "宁波市", "电子邮箱": "jiuxing@sunnyoptical.com", "专业领域": "“智能制造”数字工厂解决方案开发、建设", "专家组": "智能制造,集成电路,专用装备", "技术领域": "软件信息服务,新一代信息技术,工业创新设计", "专家类型": "行业类专家" },
        { "姓名": "翟震宇", "工作单位": "宁波市纤维检验所", "行政职务": "副所长", "技术职称/学历": "高级工程师", "移动电话": "13957885569", "地区": "宁波市", "电子邮箱": "895035582@qq.com", "专业领域": "生物化学工程", "技术领域": "时尚纺织服装,检验检测", "专家类型": "技术类专家" },
        { "姓名": "聂凤明", "工作单位": "中国兵器科学研究院宁波分院", "技术职称/学历": "研究员博士", "移动电话": "13601342992", "地区": "宁波市", "电子邮箱": "nfm2006@sina,com", "专业领域": "机械加工工艺及设备自动化", "专家组": "专用装备", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "肖江剑", "工作单位": "中国科学院宁波材料技术与工程研究所", "行政职务": "研究员", "技术职称/学历": "研究员", "移动电话": "15268393194", "地区": "宁波市", "专业领域": "计算机视觉、图像和视频处理、航空遥感、可视化和图形学、和模式识别", "专家组": "工业物联网", "技术领域": "新一代信息技术", "专家类型": "技术类专家" },
        { "姓名": "胡博", "工作单位": "宁波杉杉新材料科技有限公司", "行政职务": "总经理", "移动电话": "13817694109", "地区": "宁波市", "电子邮箱": "Hu.bo@shanshantech.com", "专业领域": "新材料", "专家组": "石墨烯", "技术领域": "新材料", "专家类型": "行业类专家" },
        { "姓名": "胡如夫", "工作单位": "宁波工程学院", "行政职务": "机械学院院长", "技术职称/学历": "教授", "移动电话": "13386651605", "地区": "宁波市", "电子邮箱": "ngyhrf2016@163.com", "专业领域": "机械工程", "专家组": "智能制造", "技术领域": "汽车制造,高端装备,检验检测,科技服务,工业创新设计", "专家类型": "技术类专家" },
        { "姓名": "胡文豪", "工作单位": "杭钢集团宁波钢铁有限公司", "行政职务": "制造管理部部长兼党支部书记", "技术职称/学历": "教授级高工", "移动电话": "13586875392", "地区": "宁波市", "电子邮箱": "huwenhao@ningbosteel.com", "专业领域": "钢铁产品研发", "专家组": "高端金属合金材料", "技术领域": "新材料", "专家类型": "技术类专家" },
        { "姓名": "胡晓阳", "工作单位": "宁波美诺华天康药业有限公司", "行政职务": "常务副总", "移动电话": "13306639696", "地区": "宁波市", "电子邮箱": "nbf@menovopharm.com", "专业领域": "制剂生产，工程管理", "技术领域": "生物医药", "专家类型": "技术类专家" },
        { "姓名": "胡超", "工作单位": "浙江大学宁波理工学院", "行政职务": "副院长", "技术职称/学历": "研究员", "移动电话": "15158309531", "地区": "宁波市", "电子邮箱": "huchao@nit.net.cn", "专业领域": "自动化装置；机器视觉与机器人应用；机电控制", "专家组": "工业物联网,专用装备,智能制造", "技术领域": "家用电器,高端装备,新一代信息技术", "专家类型": "技术类专家" },
        { "姓名": "舒文兵", "工作单位": "宁波金智源科技服务有限公司", "行政职务": "董事长", "技术职称/学历": "工程师、经济师", "移动电话": "18606746396", "地区": "宁波市", "电子邮箱": "969897051@qq.com", "专业领域": "主要从事现代新能源、新型建筑材料的研发与科技项目产学研管理，具有丰富的现代企业管理实战经验，擅长科技项目产学研管理及营销策划品牌推广。", "专家组": "高端金属合金材料,工业物联网", "技术领域": "节能环保,新材料", "专家类型": "技术类专家" },
        { "姓名": "苏玉军", "工作单位": "浙江中之杰软件技术有限公司", "行政职务": "CEO", "技术职称/学历": "高级工程师", "移动电话": "13967819660", "地区": "宁波市", "专业领域": "云计算，大数据", "专家组": "集成电路,工业物联网", "技术领域": "新一代信息技术", "专家类型": "技术类专家" },
        { "姓名": "葛仙红", "工作单位": "博格华纳汽车零部件（宁波）有限公司", "技术职称/学历": "精益六西格玛黑带", "移动电话": "15168589048", "地区": "宁波市", "电子邮箱": "xge@bunitNamewarner.com", "专业领域": "精益管理、三维建模、人工智能决策系统、数字化工厂", "技术领域": "汽车制造", "专家类型": "行业类专家" },
        { "姓名": "葛子义", "工作单位": "中科院宁波材料技术与工程研究所", "行政职务": "助理研究员", "技术职称/学历": "研究员", "移动电话": "15900641975", "地区": "宁波市", "电子邮箱": "geziyi@nimte.ac.cn", "专业领域": "有机光电", "技术领域": "清洁能源,新材料", "专家类型": "技术类专家" },
        { "姓名": "葛石松", "工作单位": "海曙区发展和改革局", "行政职务": "党组副书记、副局长", "移动电话": "13957872299", "地区": "宁波市", "电子邮箱": "shsong818@163.com", "专家类型": "政府部门专家" },
        { "姓名": "董向阳", "工作单位": "宁波乐惠国际工程装备股份有限公司", "行政职务": "董事会秘书", "技术职称/学历": "高级会计师", "移动电话": "13967818197", "地区": "宁波市", "电子邮箱": "dongxy@lehui.com", "专业领域": "工商管理", "专家组": "专用装备", "技术领域": "节能环保,高端装备,新材料", "专家类型": "财务类专家" },
        { "姓名": "蒋朝晖", "工作单位": "宁波安全三江会计师事务所有限公司", "技术职称/学历": "注册会计师", "移动电话": "13857423356", "地区": "宁波市", "专家类型": "财务类专家" },
        { "姓名": "蔡克俭", "工作单位": "宁波市经济和信息化委员会", "行政职务": "处长", "移动电话": "13605888110", "地区": "宁波市", "专家组": "智能制造,集成电路", "专家类型": "政府部门专家" },
        { "姓名": "蔡映峰", "工作单位": "公牛集团有限公司", "行政职务": "总工程师", "技术职称/学历": "教授级高工", "移动电话": "15888581003", "地区": "宁波市", "电子邮箱": "cyf@gongniu.cn", "专业领域": "机械设计", "专家组": "专用装备", "技术领域": "家用电器,高端装备", "专家类型": "技术类专家" },
        { "姓名": "袁书强", "工作单位": "中国兵器科学研究院宁波分院", "行政职务": "总工", "技术职称/学历": "研究员", "移动电话": "13777975987", "地区": "宁波市", "电子邮箱": "lsm6331@163.com", "专业领域": "新材料", "专家组": "高端金属合金材料", "技术领域": "检验检测,新材料", "专家类型": "技术类专家" },
        { "姓名": "裘洪立", "工作单位": "宁波伟立机器人科技股份有限公司", "行政职务": "董事长", "技术职称/学历": "董事长", "移动电话": "13395841558", "地区": "宁波市", "电子邮箱": "william@welllih.com", "专业领域": "高端装备中的智能制造装备、智能制造工程", "专家组": "专用装备,智能制造", "专家类型": "行业类专家" },
        { "姓名": "许百远", "工作单位": "慈溪市经信局", "行政职务": "副局长", "移动电话": "19858343696", "地区": "宁波市", "电子邮箱": "XBY1968@163.com", "专家类型": "政府部门专家" },
        { "姓名": "许高杰", "工作单位": "中国科学院宁波材料技术与工程研究所", "技术职称/学历": "研究员", "移动电话": "13454705646", "地区": "宁波市", "电子邮箱": "xugj@nimte.ac.cn", "专业领域": "高端装备中的智能制造装备", "专家组": "智能制造", "技术领域": "高端装备,新材料", "专家类型": "技术类专家" },
        { "姓名": "谢红卫", "工作单位": "宁波超霸能源有限公司", "行政职务": "总工程师", "技术职称/学历": "教授级高工", "移动电话": "18605745544", "地区": "宁波市", "电子邮箱": "xie@sonluk.com", "专业领域": "新材料", "专家组": "石墨烯", "技术领域": "新材料", "专家类型": "技术类专家" },
        { "姓名": "谭建荣", "工作单位": "浙江大学", "行政职务": "系主任", "技术职称/学历": "教授", "移动电话": "13605808375", "地区": "杭州市", "专业领域": "支持制造业企业信息化建设的技术产品；仿真软件； 企业管理软件", "技术领域": "新一代信息技术", "专家类型": "技术类专家" },
        { "姓名": "谭锁奎", "工作单位": "中国兵器科学研究院宁波分院", "技术职称/学历": "研究员", "移动电话": "13505740305", "地区": "宁波市", "电子邮箱": "tansuokui@126.com", "专业领域": "热加工技术包括铸造、锻造、热处理、焊接等技术领域", "专家组": "稀土磁性材料,高端金属合金材料", "技术领域": "节能环保,高端装备,新材料", "专家类型": "技术类专家" },
        { "姓名": "贾庆伟", "工作单位": "宁波韦尔德斯凯勒智能科技有限公司", "行政职务": "董事长/首席科技官", "技术职称/学历": "教授级高级工程师", "移动电话": "18768562728", "地区": "宁波市", "电子邮箱": "qingwei.jia@wildsc.com.cn", "专业领域": "智能控制器，机器人及智能装备", "专家组": "智能制造,专用装备,集成电路", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "贾锋平", "工作单位": "宁波国弘咨询工程有限公司", "技术职称/学历": "高级工程师", "移动电话": "13566636354", "地区": "宁波市", "专业领域": "机械工程自动化", "专家组": "智能制造", "专家类型": "技术类专家" },
        { "姓名": "赵勤", "工作单位": "市轨道交通", "技术职称/学历": "高级工程师", "移动电话": "13857866655", "地区": "宁波市", "专业领域": "工业电气自动化", "专家类型": "技术类专家" },
        { "姓名": "赵朋", "工作单位": "浙江大学", "技术职称/学历": "副教授", "移动电话": "13989805640", "地区": "杭州市", "专业领域": "材料成形加工的数字化与智能化", "专家组": "工业物联网", "专家类型": "技术类专家" },
        { "姓名": "赵超", "工作单位": "中科院宁波材料技术与工程研究所", "技术职称/学历": "研究员", "移动电话": "17855849256", "地区": "宁波市", "电子邮箱": "zhaochao@nimte.ac.cn", "专业领域": "无机化学", "技术领域": "生物医药,新材料", "专家类型": "技术类专家" },
        { "姓名": "赵龙杰", "工作单位": "宁波双鑫节能环保科技有限公司", "行政职务": "总经理", "技术职称/学历": "高级工程师", "移动电话": "13566541585", "地区": "宁波市", "电子邮箱": "284750542@qq.com", "专业领域": "锅炉、工业炉窑及汽动泵及汽动风机技术改造、工业领域常规节能和节水技术改造、蒸汽余热二次利用技术改造、清洁能源技术改造以及工业 企业清洁生产审核、节能评估等", "技术领域": "节能环保,清洁能源,科技服务", "专家类型": "技术类专家" },
        { "姓名": "路斌", "工作单位": "宁波智畅机器人系统有限公司", "行政职务": "总经理", "移动电话": "15633160288", "地区": "宁波市", "专业领域": "先进制造技术", "专家类型": "行业类专家" },
        { "姓名": "路波", "工作单位": "国家气动产品质量监督检验中心", "行政职务": "主任", "技术职称/学历": "高级工程师", "移动电话": "13857408636", "地区": "宁波市", "电子邮箱": "lubo_zju@163.com", "专业领域": "流体传动及控制、气动技术", "技术领域": "检验检测", "专家类型": "技术类专家" },
        { "姓名": "邢家溧", "工作单位": "宁波食品检验检测研究院", "行政职务": "科研中心负责人", "技术职称/学历": "工程师", "移动电话": "15888075098", "地区": "宁波市", "电子邮箱": "hellojiali77@gmail.com", "技术领域": "检验检测,科技服务", "专家类型": "技术类专家" },
        { "姓名": "邬义杰", "工作单位": "浙江大学", "行政职务": "研究室主任", "技术职称/学历": "教授", "移动电话": "13606806281", "地区": "杭州市", "专业领域": "数控装备技术,精密驱动技术", "专家组": "关键基础件", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "邬喆华", "工作单位": "浙江大学宁波理工学院", "技术职称/学历": "高级工程师", "移动电话": "13967878006", "地区": "宁波市", "电子邮箱": "wuzhehuacn@qq.com", "专业领域": "智能材料，振动控制", "专家组": "关键基础件", "技术领域": "新材料", "专家类型": "技术类专家" },
        { "姓名": "邱顺年", "工作单位": "海曙区财政局", "行政职务": "总会计师", "移动电话": "13906841729", "地区": "宁波市", "电子邮箱": "JiucbQiusn@qq.com", "专家类型": "政府部门专家" },
        { "姓名": "郑堤", "工作单位": "浙江大学宁波理工学院", "技术职称/学历": "教授", "移动电话": "13867877728", "地区": "宁波市", "专业领域": "机电一体化", "专家组": "智能制造", "专家类型": "技术类专家" },
        { "姓名": "郑子军", "工作单位": "浙江工商职业技术学院宁海机电学院", "技术职称/学历": "副教授", "移动电话": "13616882717", "地区": "宁波市", "电子邮箱": "273532553@qq.com", "专业领域": "机械制造及其自动化", "专家组": "关键基础件", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "郑德春", "工作单位": "宁波工程学院", "技术职称/学历": "副教授", "移动电话": "13777134380", "地区": "宁波市", "电子邮箱": "nbzhengdc@126.com", "专家组": "专用装备,集成电路,集成电路", "专家类型": "技术类专家" },
        { "姓名": "郑志军", "工作单位": "宁波市鄞州亚大汽车管件有限公司", "行政职务": "技术总监", "移动电话": "13567888991", "地区": "宁波市", "专业领域": "从事汽车关键零部件技术研发，具备工程师资格，曾先后多次到日本、意大利、德国、台湾等国家去考察实习。带领研发团队成功研发制动管路系统、发动机冷却系统、汽车刹车管接头系列、汽车动力传动系统总成、汽车燃油管总成、汽车空调管路总成", "专家组": "高端金属合金材料", "技术领域": "汽车制造", "专家类型": "行业类专家" },
        { "姓名": "郑文华", "工作单位": "宁波川拓自动化科技有限公司", "行政职务": "技术总监", "技术职称/学历": "博士", "移动电话": "13586535086", "地区": "宁波市", "电子邮箱": "ccdodo@qq.com", "专业领域": "从事步进、伺服各类电机的驱动器开发和相关控制算法的研究", "专家组": "关键基础件", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "郑睿行", "工作单位": "宁波食品检验检测研究院", "行政职务": "副主任", "技术职称/学历": "高级工程师", "移动电话": "13586688122", "地区": "宁波市", "电子邮箱": "13865867@qq.com", "专业领域": "食品检验", "技术领域": "检验检测", "专家类型": "技术类专家" },
        { "姓名": "郑祥明", "工作单位": "乐歌人体工学科技股份有限公司", "技术职称/学历": "副教授", "移动电话": "15067409639", "地区": "宁波市", "电子邮箱": "48719044@qq.com", "专家组": "专用装备", "技术领域": "汽车制造,高端装备,新材料", "专家类型": "技术类专家" },
        { "姓名": "郑霖", "工作单位": "杭州大心智企业管理咨询公司", "行政职务": "总经理", "移动电话": "15825533698", "地区": "杭州市", "专业领域": "信息化，物联网，供应链管理，流程重组", "专家组": "工业物联网", "技术领域": "新一代信息技术", "专家类型": "行业类专家" },
        { "姓名": "郭一萍", "工作单位": "宁波市产品质量监督检验研究院", "行政职务": "国家塑机中心常务副主任", "技术职称/学历": "高级工程师", "移动电话": "13805843610", "地区": "宁波市", "电子邮箱": "13805843610@163.com", "专业领域": "金属材料", "专家组": "专用装备,关键基础件", "技术领域": "高端装备,检验检测", "专家类型": "技术类专家" },
        { "姓名": "郭淑梅", "工作单位": "宁波长振铜业", "行政职务": "技术副总经理", "移动电话": "13600623280", "地区": "宁波市", "电子邮箱": "gsmgsm2013@163.com", "专业领域": "铜及铜合金产品研发与工艺研发", "专家组": "高端金属合金材料", "技术领域": "新材料", "专家类型": "技术类专家" },
        { "姓名": "金美菊", "工作单位": "宁波市纤维检验所", "技术职称/学历": "高级工程师", "移动电话": "13805894728", "地区": "宁波市", "电子邮箱": "jmjzhong@yeah.net", "专业领域": "纺织工程", "技术领域": "时尚纺织服装", "专家类型": "技术类专家" },
        { "姓名": "钱微君", "工作单位": "宁波市纤维检验所", "技术职称/学历": "高级工程师", "移动电话": "13685829863", "地区": "宁波市", "电子邮箱": "qweijun@hotmail.com", "专业领域": "纺织工程", "技术领域": "时尚纺织服装,检验检测", "专家类型": "技术类专家" },
        { "姓名": "钱志鸿", "工作单位": "慈溪市天行电器有限公司", "移动电话": "13805828234", "地区": "宁波市", "电子邮箱": "qzh@cxtianxing.com", "专业领域": "机械制造", "专家组": "关键基础件", "技术领域": "高端装备,新一代信息技术", "专家类型": "行业类专家" },
        { "姓名": "闻人红权", "工作单位": "浙江佳贝思绿色能源有限公司", "行政职务": "副总经理", "技术职称/学历": "高级工程师", "移动电话": "13905840590", "地区": "宁波市", "电子邮箱": "wenren1969@163.com", "专业领域": "海洋化学", "专家组": "石墨烯", "技术领域": "清洁能源", "专家类型": "技术类专家" },
        { "姓名": "闻人红雁", "工作单位": "浙江佳贝思绿色能源有限公司", "技术职称/学历": "高级工程师", "移动电话": "13705849118", "地区": "宁波市", "电子邮箱": "wwrhy55@163.com", "专业领域": "电子自动化", "专家组": "石墨烯", "技术领域": "清洁能源", "专家类型": "技术类专家" },
        { "姓名": "阎伟", "工作单位": "海天塑机集团", "技术职称/学历": "高级工程师", "移动电话": "13706848189", "地区": "宁波市", "专业领域": "工业电气自动化", "专家类型": "技术类专家" },
        { "姓名": "阮殿波", "工作单位": "宁波中车新能源科技有限公司", "行政职务": "总工程师", "技术职称/学历": "教授级高工", "移动电话": "18858059059", "地区": "宁波市", "电子邮箱": "dbruan@crrccap.com", "专业领域": "超级电容器及新能源技术", "专家组": "关键基础件,石墨烯", "技术领域": "节能环保,汽车制造,高端装备,新一代信息技术,新材料", "专家类型": "技术类专家" },
        { "姓名": "陆军华", "工作单位": "余姚市经济和信息化局", "行政职务": "副局长", "移动电话": "13905841890", "地区": "宁波市", "专业领域": "从事项目行政审批,经济管理,自动化装备应用等研究", "专家组": "专用装备", "专家类型": "政府部门专家" },
        { "姓名": "陆友良", "工作单位": "敏实集团技术研发中心", "行政职务": "敏实集团技术研发中心", "技术职称/学历": "高级工程师", "移动电话": "13586565837", "地区": "宁波市", "电子邮箱": "Youliang.lu@minthgroup.com", "专业领域": "汽车零部件设计研发、轻量化、智能生产", "专家组": "工业物联网,专用装备", "技术领域": "汽车制造", "专家类型": "技术类专家" },
        { "姓名": "陆弢", "工作单位": "北仑区经信局", "行政职务": "副局长", "移动电话": "13515889738", "地区": "宁波市", "电子邮箱": "lutao@netd.gov.cn", "专家类型": "政府部门专家" },
        { "姓名": "陈世豪", "工作单位": "宁波市财政局工交处", "行政职务": "处长", "移动电话": "13805881482", "地区": "宁波市", "专家组": "智能制造,集成电路", "专家类型": "政府部门专家" },
        { "姓名": "陈亮", "工作单位": "中科院宁波材料所", "行政职务": "所长", "技术职称/学历": "研究员", "移动电话": "13736188420", "地区": "宁波市", "电子邮箱": "chenliang@nimte.ac.cn", "专业领域": "材料物理与化学", "技术领域": "节能环保,清洁能源,新材料", "专家类型": "技术类专家" },
        { "姓名": "陈仁杰", "工作单位": "中国科学院宁波材料技术与工程研究所", "技术职称/学历": "研究员", "移动电话": "15857426670", "地区": "宁波市", "电子邮箱": "chenrj@nimte.ac.cn", "专业领域": "稀土永磁材料", "专家组": "高端金属合金材料", "技术领域": "节能环保,新材料", "专家类型": "技术类专家" },
        { "姓名": "陈军", "工作单位": "宁波广播电视集团", "行政职务": "副主任", "技术职称/学历": "高级工程师", "移动电话": "13806662559", "地区": "宁波市", "电子邮箱": "67291025@qq.com", "专业领域": "大数据、物联网、云计算等", "专家组": "工业物联网", "技术领域": "新一代信息技术,科技服务", "专家类型": "技术类专家" },
        { "姓名": "陈凤华", "工作单位": "宁波浙大联科科技有限公司", "行政职务": "技术总监", "技术职称/学历": "高级工程师", "移动电话": "13858396298", "地区": "宁波市", "专业领域": "智能制造、数字化设计管理", "专家组": "智能制造,集成电路", "技术领域": "新一代信息技术", "专家类型": "技术类专家" },
        { "姓名": "陈刚", "工作单位": "博格华纳汽车零部件（宁波）有限公司", "行政职务": "制造部总监", "移动电话": "18067252960", "地区": "宁波市", "电子邮箱": "chainchen@bunitNamewarner.com", "技术领域": "汽车制造,高端装备", "专家类型": "行业类专家" },
        { "姓名": "陈友汜", "工作单位": "中科院宁波材料技术与工程研究所", "技术职称/学历": "研究员", "移动电话": "13958221325", "地区": "宁波市", "电子邮箱": "chys@nimte.ac.cn", "专业领域": "特种纤维及复合材料", "技术领域": "新材料", "专家类型": "技术类专家" },
        { "姓名": "陈姗", "工作单位": "宁波市产品质量监督检验研究院", "行政职务": "电子电器室副主任", "技术职称/学历": "高级工程师", "移动电话": "13685732339", "地区": "宁波市", "电子邮箱": "cs203@sina.com", "专业领域": "精密仪器及机械", "技术领域": "家用电器,检验检测", "专家类型": "技术类专家" },
        { "姓名": "陈富乳", "工作单位": "宁波伟立机器人科技有限公司", "移动电话": "13429230715", "地区": "宁波市", "专业领域": "面向注塑行业的自动化生产线应用；塑料包装行业高速模内贴标机械手的应用；线性加关节的混联型机器人的研发及应用", "专家组": "工业物联网", "技术领域": "高端装备", "专家类型": "行业类专家" },
        { "姓名": "陈希良", "工作单位": "中国科学院宁波材料技术与工程研究所", "行政职务": "研究员", "技术职称/学历": "研究员", "移动电话": "15372603691", "地区": "宁波市", "电子邮箱": "chenxl@nimte.ac.cn", "专业领域": "高端装备中的智能制造装备、智能制造工程", "专家组": "集成电路,工业物联网", "技术领域": "汽车制造,新一代信息技术", "专家类型": "技术类专家" },
        { "姓名": "陈庆盈", "工作单位": "中国科学院宁波材料技术与工程研究所", "行政职务": "研究员", "技术职称/学历": "研究员", "移动电话": "13736159948", "地区": "宁波市", "专业领域": "高端装备中的智能制造装备、智能制造工程", "专家组": "智能制造,专用装备", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "陈廉清", "工作单位": "宁波工程学院创业学院", "行政职务": "执行院长", "技术职称/学历": "教授", "移动电话": "13957420595", "地区": "宁波市", "电子邮箱": "nbclq@sina.com", "专业领域": "机械制造及自动化", "专家组": "专用装备,关键基础件", "技术领域": "高端装备,检验检测,科技服务", "专家类型": "技术类专家" },
        { "姓名": "陈彪", "工作单位": "宁波高新区晓圆科技有限公司", "技术职称/学历": "高级工程师", "移动电话": "13906523209", "地区": "宁波市", "电子邮箱": "chenbiao@hz.cn", "专业领域": "无线通信和光通信技术、光电检测技术，提供工业通信与信息系统完整解决方案", "专家组": "光学电子,工业物联网", "技术领域": "新一代信息技术", "专家类型": "技术类专家" },
        { "姓名": "陈才明", "工作单位": "宁波新容电气有限公司", "行政职务": "总工程师（原）　", "技术职称/学历": "高工", "移动电话": "13003720260", "地区": "宁波市", "电子邮箱": "mero319@126.com", "专家类型": "技术类专家" },
        { "姓名": "陈春学", "工作单位": "建新赵氏集团有限公司", "行政职务": "总裁助理、工会主席、党总支书记", "技术职称/学历": "高级工程师", "移动电话": "13780063389", "地区": "宁波市", "电子邮箱": "ccx@jianxin.com", "专业领域": "汽车零部件", "专家组": "智能制造,关键基础件", "技术领域": "汽车制造", "专家类型": "技术类专家" },
        { "姓名": "陈燕智", "工作单位": "宁波普利达智能科技应用有限公司", "行政职务": "副董事长兼总经理", "技术职称/学历": "教授级高级工程师", "移动电话": "18758807744", "地区": "宁波市", "专业领域": "机械自动化", "专家组": "智能制造,集成电路", "专家类型": "技术类专家" },
        { "姓名": "陈立", "工作单位": "新松机器人/新松工业机器人", "技术职称/学历": "高级工程师", "移动电话": "18667151277", "地区": "宁波市", "电子邮箱": "chengli.hz@siasun.com", "专业领域": "工业机器人、高功率激光工业及工业自动化装备共性关键技术的研究和应用", "专家组": "专用装备", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "陈起来", "工作单位": "宁波广播电视集团", "行政职务": "主任", "技术职称/学历": "高级工程师", "移动电话": "13567484856", "地区": "宁波市", "电子邮箱": "99506287@qq.com", "专业领域": "大数据、物联网、云计算等", "专家组": "工业物联网", "技术领域": "新一代信息技术", "专家类型": "技术类专家" },
        { "姓名": "韩光宇", "工作单位": "余姚中禾信会计师事务所有限公司", "技术职称/学历": "注册会计师", "移动电话": "13065813550", "地区": "宁波市", "专家类型": "财务类专家" },
        { "姓名": "顾初青", "工作单位": "宁海县第一注塑模具有限公司", "行政职务": "总工程师", "技术职称/学历": "高级工程师", "移动电话": "13858272720", "地区": "宁波市", "电子邮箱": "mfdesign@chinamold.com", "专业领域": "机械和模具设计制造、制造企业管理", "专家组": "专用装备", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "顾新建", "工作单位": "浙江大学", "行政职务": "副主任", "技术职称/学历": "教授", "移动电话": "13738095338", "地区": "杭州市", "电子邮箱": "xjgu@zju.edu.cn", "专业领域": "创新和知识管理、大批量定制,产品模块化,网络化制造、大数据、工业工程", "专家组": "工业物联网", "技术领域": "新一代信息技术", "专家类型": "技术类专家" },
        { "姓名": "顾静亚", "工作单位": "宁波正源会计师事务所有限公司", "移动电话": "13967814902", "地区": "宁波市", "专家类型": "财务类专家" },
        { "姓名": "颜雪冬", "工作单位": "宁波维科电池股份有限公司", "行政职务": "研发总监", "技术职称/学历": "博士", "移动电话": "13515887371", "地区": "宁波市", "电子邮箱": "yxdong@mail.veken.com", "专业领域": "新能源、新材料，锂离子电池极其关键材料的研发及制造", "专家组": "石墨烯", "技术领域": "新材料", "专家类型": "技术类专家" },
        { "姓名": "马修水", "工作单位": "浙江大学宁波理工学院", "行政职务": "副院长", "技术职称/学历": "教授", "移动电话": "13685891614", "地区": "宁波市", "电子邮箱": "mxsh63@aliyun.com", "专业领域": "仪器制造业,机械加工,量具制造业", "专家组": "智能制造,工业物联网,专用装备,集成电路,关键基础件", "技术领域": "海洋高技术,家用电器,汽车制造,高端装备,新一代信息技术,检验检测", "专家类型": "技术类专家" },
        { "姓名": "马少龙", "工作单位": "西安电子科技大学宁波信息技术研究院", "行政职务": "副院长", "技术职称/学历": "高级工程师", "移动电话": "18858459988", "地区": "宁波市", "电子邮箱": "2845169366qq.com", "专业领域": "通信、物联网", "专家组": "工业物联网", "技术领域": "新一代信息技术", "专家类型": "技术类专家" },
        { "姓名": "马萍", "工作单位": "宁波市产品质量监督检验研究院", "技术职称/学历": "高级工程师", "移动电话": "15968410598", "地区": "宁波市", "电子邮箱": "228090888@qq.com", "专业领域": "材料学", "技术领域": "检验检测", "专家类型": "技术类专家" },
        { "姓名": "马超", "工作单位": "宁波市浪尖工业设计有限公司", "行政职务": "总经理", "移动电话": "13857844503", "地区": "宁波市", "电子邮箱": "nbid@artopcn.com", "专业领域": "工业设计", "技术领域": "工业创新设计", "专家类型": "行业类专家" },
        { "姓名": "高伟波", "工作单位": "宁波市计量测试研究院", "行政职务": "科技带头人", "移动电话": "18868933466", "地区": "宁波市", "电子邮箱": "46321132@qq.com", "专业领域": "凝聚态物理", "专家组": "稀土磁性材料", "技术领域": "检验检测,新材料", "专家类型": "行业类专家" },
        { "姓名": "高永峰", "工作单位": "宁波欣达集团有限公司", "技术职称/学历": "高级工程师", "移动电话": "13082910902", "地区": "宁波市", "专业领域": "机械设计", "技术领域": "工业创新设计", "专家类型": "技术类专家" },
        { "姓名": "高海军", "工作单位": "宁波市发展和改革委员会工业处", "行政职务": "处长", "移动电话": "13884461675", "地区": "宁波市", "专家组": "集成电路,智能制造", "专家类型": "政府部门专家" },
        { "姓名": "高鸿权", "工作单位": "浙江斐尔德智能设备有限公司", "行政职务": "总经理", "移动电话": "13685888589", "地区": "宁波市", "电子邮箱": "gaohongquan@field-china.com", "专业领域": "化纤行业专家。目前主要从事物流自动化设备研究制造", "专家组": "专用装备", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "魏恒斗", "工作单位": "宁波华辉磁业有限公司", "移动电话": "15857426737", "地区": "宁波市", "电子邮箱": "whd@hhmagnet.com", "专业领域": "稀土永磁、非晶软磁", "技术领域": "新材料", "专家类型": "行业类专家" },
        { "姓名": "魏晓云", "工作单位": "慈溪市经济发展局", "行政职务": "科长（已退休）", "移动电话": "13606882198", "地区": "宁波市", "电子邮箱": "302833012@qq.com", "专业领域": "电子技术、电子电器设计、机电 技改、科技项目管理", "专家类型": "政府部门专家" },
        { "姓名": "鲁翠强", "工作单位": "浙江纺织服装职业技术学院", "技术职称/学历": "副教授", "移动电话": "13958215451", "地区": "宁波市", "电子邮箱": "664547565@qq.com", "技术领域": "时尚纺织服装,高端装备,新一代信息技术,新材料,工业创新设计", "专家类型": "技术类专家" },
        { "姓名": "鲍俊", "工作单位": "宁波市标准化研究院", "行政职务": "院长", "技术职称/学历": "教授级高工", "移动电话": "13805860554", "地区": "宁波市", "专业领域": "仪表与测试系统", "技术领域": "家用电器,检验检测,科技服务", "专家类型": "技术类专家" },
        { "姓名": "鲍建宇", "工作单位": "宁波大红鹰学院", "技术职称/学历": "副教授", "移动电话": "18067381853", "地区": "宁波市", "电子邮箱": "jianyu_bao@126.com", "专业领域": "LED驱动电源及LED照明智能调光控制技术；新能源电力电子变换技术；先进电机控制技术", "专家组": "专用装备,光学电子", "技术领域": "节能环保,清洁能源,高端装备", "专家类型": "技术类专家" },
        { "姓名": "麻桂杨", "工作单位": "博格华纳（宁波）汽车零部件有限公司", "行政职务": "运营总监", "移动电话": "13968206828", "地区": "宁波市", "电子邮箱": "sma@bunitNamewarner.com", "专业领域": "汽车制造、智能制造工程、 高端装备中的智能制造设备", "技术领域": "汽车制造,高端装备", "专家类型": "行业类专家" },
        { "姓名": "黄伟达", "工作单位": "宁波恒拓物联网有限公司", "行政职务": "董事长", "移动电话": "15888066888", "地区": "宁波市", "电子邮箱": "630398333@qq.com", "专业领域": "物联网技术、大数据、信息技术和技术改造", "专家组": "工业物联网", "技术领域": "节能环保,软件信息服务,新一代信息技术", "专家类型": "行业类专家" },
        { "姓名": "黄又举", "工作单位": "中国科学院宁波材料技术与工程研究所", "技术职称/学历": "研究员", "移动电话": "13957816713", "地区": "宁波市", "电子邮箱": "yjhuang@nimte.ac.cn", "专业领域": "新材料与纳米技术", "技术领域": "检验检测,新材料", "专家类型": "技术类专家" },
        { "姓名": "黄可可", "工作单位": "宁波兴隆磁性技术有限公司", "行政职务": "总经理", "移动电话": "13957889099", "地区": "宁波市", "专业领域": "稀土磁性材料、专用装备、智能制造装备，检验检测、智能制造工程", "专家组": "稀土磁性材料,专用装备", "技术领域": "检验检测,新材料", "专家类型": "行业类专家" },
        { "姓名": "黄小明", "工作单位": "宁波裕江特种胶带有限公司", "行政职务": "董事长", "技术职称/学历": "高级工程师", "移动电话": "13805868186", "地区": "宁波市", "电子邮箱": "nbxmhuang@gmail.com", "专业领域": "机械设计", "技术领域": "绿色石化,汽车制造,高端装备,新一代信息技术,新材料", "专家类型": "技术类专家" },
        { "姓名": "黄幼琴", "工作单位": "宁波宏都投资有限公司", "行政职务": "财务总监", "技术职称/学历": "高级会计师", "移动电话": "13306695155", "地区": "宁波市", "电子邮箱": "273229787@qq.com", "专业领域": "会计学", "专家组": "关键基础件", "技术领域": "汽车制造,新材料", "专家类型": "财务类专家" },
        { "姓名": "黄庆福", "工作单位": "宁波中车新能源科技有限公司", "行政职务": "副总工程师", "技术职称/学历": "高级工程师", "移动电话": "15088407029", "地区": "宁波市", "电子邮箱": "qfhuang@crrccap.com", "专业领域": "超级电容器工艺及装备", "专家组": "石墨烯,关键基础件", "技术领域": "节能环保,汽车制造,高端装备,新一代信息技术,新材料", "专家类型": "技术类专家" },
        { "姓名": "黄方平", "工作单位": "浙江大学宁波理工学院", "技术职称/学历": "副教授", "移动电话": "13454703259", "地区": "宁波市", "专业领域": "重点指导液压气动密封行业元件与系统制造企业、元件与系统应用企业,专用设备制造业的转型升级和自动化、智能化改造", "专家组": "专用装备", "技术领域": "高端装备", "专家类型": "技术类专家" },
        { "姓名": "黄明强", "工作单位": "宁波海通科技有限公司", "行政职务": "公共设施部部长", "技术职称/学历": "高级工程师", "移动电话": "13968225839", "地区": "宁波市", "电子邮箱": "hmq@haitonggroup.com", "专业领域": "机电设备与环保工程", "专家组": "专用装备", "技术领域": "节能环保,汽车制造", "专家类型": "技术类专家" },
        { "姓名": "黄晁", "工作单位": "宁波中科集成电路设计中心有限公司", "技术职称/学历": "研究员", "移动电话": "13777020991", "地区": "宁波市", "电子邮箱": "chuang@ict.ac.cn", "专业领域": "集成电路产品设计", "专家组": "集成电路", "专家类型": "技术类专家" },
        { "姓名": "龚秉周", "工作单位": "宁波大学机械工程与力学学院", "技术职称/学历": "教授", "移动电话": "13867877819", "地区": "宁波市", "专业领域": "机械设计制造及自动化", "专家组": "智能制造", "专家类型": "技术类专家" }
    ]

    const userid = req.userid;
    const params = {};
    params.task_id = req.taskId;
    params.created_datetime = formatDateTime(date);

    function prepreocess(triples) {
        var H = {}, R = {}, T = {}, hUpO = {}, tUpO = {}, tO = {}, hO = {}
        triples.forEach(triple => {
            var czy = ["武汉", "黄石", "鄂州", "黄冈", "孝感", "咸宁", "仙桃", "潜江", "天门", "襄阳", "宜昌", "荆州", "荆门", "长沙", "株洲", "湘潭", "岳阳", "益阳", "常德", "衡阳", "娄底", "南昌", "九江", "景德镇", "鹰潭", "新余", "宜春", "萍乡", "上饶", "抚州", "吉安"]
            var hc = ["哈尔滨", "大庆", "齐齐哈尔", "绥化", "牡丹江", "长春", "吉林", "四平", "辽源", "松原", "延边"]
            var cy = ["成都", "重庆", "自贡", "泸州", "德阳", "遂宁", "内江", "乐山", "南充", "眉山", "宜宾", "广安", "资阳", "绵阳", "达州", "雅安"]
            var csj = ["上海", "南京", "无锡", "常州", "苏州", "南通", "盐城", "扬州", "镇江", "泰州", "杭州", "宁波", "嘉兴", "湖州", "绍兴", "金华", "舟山", "台州", "合肥", "芜湖", "马鞍山", "铜陵", "安庆", "滁州", "池州", "宣城"]
            var zy = ["郑州", "洛阳", "开封", "南阳", "安阳", "商丘", "新乡", "平顶山", "许昌", "焦作", "周口", "信阳", "驻马店", "鹤壁", "濮阳", "漯河", "三门峡", "济源", "长治", "晋城", "运城", "邢台", "邯郸", "聊城", "菏泽", "宿州", "淮北", "蚌埠", "阜阳", "亳州"]
            var bbw = ["南宁", "北海", "钦州", "防城港", "玉林", "崇左", "湛江", "茂名", "阳江", "海口", "儋州", "东方", "澄迈", "临高", "昌江"]
            var gzpy = ["西安", "宝鸡", "咸阳", "铜川", "渭南", "商洛", "运城", "临汾", "天水", "平凉", "庆阳"]
            var hbey = ["呼和浩特", "包头", "鄂尔多斯", "榆林"]
            var lx = ["兰州", "西宁", "海东", "白银", "定西", "临夏回族自治州", "海北藏族自治州", "海南藏族自治州", "黄南藏族自治州"]
            var jjj = ["北京", "天津", "石家庄", "唐山", "保定", "秦皇岛", "廊坊", "沧州", "承德", "张家口"]

            var expert = {}, attr = {}, unitName = {}, attrUnitName = {}
            expert.label = "专家"
            attr.label = "专家"
            unitName.label = "单位"
            attrUnitName.label = "单位"

            expert['技术领域'] = triple['技术领域']
            expert['专家组'] = triple['专家组']
            expert['专家类型'] = triple['专家类型']

            expert.address = triple['地区']
            expert.city = triple['地区']
            expert.professionName = triple['技术职称/学历']
            expert['行政职务'] = triple['行政职务']
            expert.tel = triple['移动电话']
            expert.email = triple['电子邮箱']
            expert.researchField = triple['专业领域']

            expert.name = triple['姓名']
            expert.personName = triple['姓名']
            expert.org = triple['工作单位']

            attr.name = triple['姓名']
            // attr.professionName = triple['技术职称/学历']
            attr.address = triple['地区']
            attr.email = expert.email
            attr.tel = expert.tel
            attr.org = triple['工作单位']

            unitName.unitName = triple['工作单位']
            unitName.name = unitName.unitName
            unitName.address = triple['地区']
            attrUnitName.unitName = triple['工作单位']

            czy.forEach(data => {
                if (expert.address.includes(data)) {
                    expert.urbanCluster = '长江中游城市群'
                }
            })
            hc.forEach(data => {
                if (expert.address.includes(data)) {
                    expert.urbanCluster = '哈长城市群'
                }
            })
            cy.forEach(data => {
                if (expert.address.includes(data)) {
                    expert.urbanCluster = '成渝城市群'
                }
            })
            csj.forEach(data => {
                if (expert.address.includes(data)) {
                    expert.urbanCluster = '长三角城市群'
                }
            })
            zy.forEach(data => {
                if (expert.address.includes(data)) {
                    expert.urbanCluster = '中原城市群'
                }
            })
            bbw.forEach(data => {
                if (expert.address.includes(data)) {
                    expert.urbanCluster = '北部湾城市群'
                }
            })
            gzpy.forEach(data => {
                if (expert.address.includes(data)) {
                    expert.urbanCluster = '关中平原城市群'
                }
            })
            hbey.forEach(data => {
                if (expert.address.includes(data)) {
                    expert.urbanCluster = '呼包鄂榆城市群'
                }
            })
            lx.forEach(data => {
                if (expert.address.includes(data)) {
                    expert.urbanCluster = '兰西城市群'
                }
            })
            jjj.forEach(data => {
                if (expert.address.includes(data)) {
                    expert.urbanCluster = '京津冀城市群'
                }
            })

            var name = expert.name + expert.tel + "_" + unitName.unitName
            H[name] = attr
            R[name] = { label: '所属单位' }
            T[name] = attrUnitName

            hO[name] = expert
            hUpO[name] = attr
            tO[name] = unitName
            tUpO[name] = attrUnitName
        })
        var obj = {}
        obj["H"] = H
        obj["R"] = R
        obj["T"] = T
        obj["hO"] = hO
        obj["hUpO"] = hUpO
        obj["tO"] = tO
        obj["tUpO"] = tUpO
        return obj
    }

    var exData = {};

    var NODE = [];

    var LINK = [];

    var id = [];

    var count = 0

    var i1 = 0, j1 = 1

    var obj = prepreocess(req)

    for (var dd in obj.hUpO) {
        var hTmp = {}
        hTmp[dd] = obj.hO[dd]
        var hUpTmp = {}
        hUpTmp[dd] = obj.hUpO[dd]

        // merge 结点
        var res3 = await (new Promise(function (resolve, reject) {
            graphdb.mergeOnEntity(hTmp, hUpTmp)
                .then(result => {
                    const response3 = {
                        code: 20000,
                        msg: 'database request success'
                    }
                    resolve(response3)
                })
                .catch(error => {
                    const response3 = {
                        code: 50000,
                        msg: 'database request bad',
                    }
                    resolve(response3)
                })
                
        }).then(function (response3) {
            console.log(response3)
            return JSON.stringify(response3)
        })
        )
    }

    for (var cc in obj.tUpO) {
        var tTmp = {}
        tTmp[cc] = obj.tO[cc]
        var tUpTmp = {}
        tUpTmp[cc] = obj.tUpO[cc]

        // merge 结点
        var res2 = await (new Promise(function (resolve, reject) {
            graphdb.mergeOnEntity(tTmp, tUpTmp)
                .then(result => {
                    const response2 = {
                        code: 20000,
                        msg: 'database request success'
                    }
                    resolve(response2)
                })
                .catch(error => {
                    const response2 = {
                        code: 50000,
                        msg: 'database request bad',
                    }
                    resolve(response2)
                })
                
        }).then(function (response2) {
            console.log(response2)
            return JSON.stringify(response2)
        })
        )
    }

    // merge 关系
    for (var kk in obj.R) {
        var hTmp = {}
        hTmp[kk] = obj.H[kk]
        var rTmp = {}
        rTmp[kk] = obj.R[kk]
        var tTmp = {}
        tTmp[kk] = obj.T[kk]

        var res = await (new Promise(function (resolve, reject) {
            graphdb.mergeRelationshipBatchRel(hTmp, rTmp, tTmp)
                .then(result => {
                    result.records.forEach(record => {
                        record._fields.forEach(i => {
                            if (i.__proto__.__isNode__) {
                                NODE.push(i)
                                count = count + 1
                            }
                            else {
                                LINK.push(i)
                            }
                        })
                    })
                    exData.nodes = NODE;
                    exData.relationships = LINK;
                    exData.cypher = result.summary.query.text
                    const response = {
                        code: 20000,
                        data: exData,
                        count: count,
                        msg: 'database request success'
                    }
                    resolve(response)
                })
                .catch(error => {
                    const response = {
                        code: 50000,
                        data: exData,
                        msg: 'database request bad',

                    }
                    resolve(response)
                })
                
        }).then(function (response) {
            console.log(response)
            return JSON.stringify(response)
        })
        )
        this.body = res
    }
}

module.exports = zsglExpert2kg
